###################################################################

# Created by write_sdc on Wed Apr 27 11:29:17 2022

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_load -pin_load 1 [get_ports busy]
set_load -pin_load 1 [get_ports out_valid]
set_load -pin_load 1 [get_ports {color_index[1]}]
set_load -pin_load 1 [get_ports {color_index[0]}]
set_load -pin_load 1 [get_ports {image_out_index[4]}]
set_load -pin_load 1 [get_ports {image_out_index[3]}]
set_load -pin_load 1 [get_ports {image_out_index[2]}]
set_load -pin_load 1 [get_ports {image_out_index[1]}]
set_load -pin_load 1 [get_ports {image_out_index[0]}]
set_max_fanout 6 [get_ports clk]
set_max_fanout 6 [get_ports reset]
set_max_fanout 6 [get_ports {image_in_index[4]}]
set_max_fanout 6 [get_ports {image_in_index[3]}]
set_max_fanout 6 [get_ports {image_in_index[2]}]
set_max_fanout 6 [get_ports {image_in_index[1]}]
set_max_fanout 6 [get_ports {image_in_index[0]}]
set_max_fanout 6 [get_ports {pixel_in[23]}]
set_max_fanout 6 [get_ports {pixel_in[22]}]
set_max_fanout 6 [get_ports {pixel_in[21]}]
set_max_fanout 6 [get_ports {pixel_in[20]}]
set_max_fanout 6 [get_ports {pixel_in[19]}]
set_max_fanout 6 [get_ports {pixel_in[18]}]
set_max_fanout 6 [get_ports {pixel_in[17]}]
set_max_fanout 6 [get_ports {pixel_in[16]}]
set_max_fanout 6 [get_ports {pixel_in[15]}]
set_max_fanout 6 [get_ports {pixel_in[14]}]
set_max_fanout 6 [get_ports {pixel_in[13]}]
set_max_fanout 6 [get_ports {pixel_in[12]}]
set_max_fanout 6 [get_ports {pixel_in[11]}]
set_max_fanout 6 [get_ports {pixel_in[10]}]
set_max_fanout 6 [get_ports {pixel_in[9]}]
set_max_fanout 6 [get_ports {pixel_in[8]}]
set_max_fanout 6 [get_ports {pixel_in[7]}]
set_max_fanout 6 [get_ports {pixel_in[6]}]
set_max_fanout 6 [get_ports {pixel_in[5]}]
set_max_fanout 6 [get_ports {pixel_in[4]}]
set_max_fanout 6 [get_ports {pixel_in[3]}]
set_max_fanout 6 [get_ports {pixel_in[2]}]
set_max_fanout 6 [get_ports {pixel_in[1]}]
set_max_fanout 6 [get_ports {pixel_in[0]}]
create_clock [get_ports clk]  -period 50  -waveform {0 25}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports reset]
set_input_delay -clock clk  1  [get_ports {image_in_index[4]}]
set_input_delay -clock clk  1  [get_ports {image_in_index[3]}]
set_input_delay -clock clk  1  [get_ports {image_in_index[2]}]
set_input_delay -clock clk  1  [get_ports {image_in_index[1]}]
set_input_delay -clock clk  1  [get_ports {image_in_index[0]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[23]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[22]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[21]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[20]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[19]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[18]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[17]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[16]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[15]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[14]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[13]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[12]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[11]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[10]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[9]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[8]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[7]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[6]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[5]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[4]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[3]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[2]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[1]}]
set_input_delay -clock clk  1  [get_ports {pixel_in[0]}]
set_output_delay -clock clk  1  [get_ports busy]
set_output_delay -clock clk  1  [get_ports out_valid]
set_output_delay -clock clk  1  [get_ports {color_index[1]}]
set_output_delay -clock clk  1  [get_ports {color_index[0]}]
set_output_delay -clock clk  1  [get_ports {image_out_index[4]}]
set_output_delay -clock clk  1  [get_ports {image_out_index[3]}]
set_output_delay -clock clk  1  [get_ports {image_out_index[2]}]
set_output_delay -clock clk  1  [get_ports {image_out_index[1]}]
set_output_delay -clock clk  1  [get_ports {image_out_index[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports {image_in_index[4]}]
set_drive 1  [get_ports {image_in_index[3]}]
set_drive 1  [get_ports {image_in_index[2]}]
set_drive 1  [get_ports {image_in_index[1]}]
set_drive 1  [get_ports {image_in_index[0]}]
set_drive 1  [get_ports {pixel_in[23]}]
set_drive 1  [get_ports {pixel_in[22]}]
set_drive 1  [get_ports {pixel_in[21]}]
set_drive 1  [get_ports {pixel_in[20]}]
set_drive 1  [get_ports {pixel_in[19]}]
set_drive 1  [get_ports {pixel_in[18]}]
set_drive 1  [get_ports {pixel_in[17]}]
set_drive 1  [get_ports {pixel_in[16]}]
set_drive 1  [get_ports {pixel_in[15]}]
set_drive 1  [get_ports {pixel_in[14]}]
set_drive 1  [get_ports {pixel_in[13]}]
set_drive 1  [get_ports {pixel_in[12]}]
set_drive 1  [get_ports {pixel_in[11]}]
set_drive 1  [get_ports {pixel_in[10]}]
set_drive 1  [get_ports {pixel_in[9]}]
set_drive 1  [get_ports {pixel_in[8]}]
set_drive 1  [get_ports {pixel_in[7]}]
set_drive 1  [get_ports {pixel_in[6]}]
set_drive 1  [get_ports {pixel_in[5]}]
set_drive 1  [get_ports {pixel_in[4]}]
set_drive 1  [get_ports {pixel_in[3]}]
set_drive 1  [get_ports {pixel_in[2]}]
set_drive 1  [get_ports {pixel_in[1]}]
set_drive 1  [get_ports {pixel_in[0]}]
