###################################################################

# Created by write_sdc on Thu Apr 28 17:36:45 2022

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_load -pin_load 0.01 [get_ports busy]
set_load -pin_load 0.01 [get_ports valid]
set_load -pin_load 0.01 [get_ports {iot_out[127]}]
set_load -pin_load 0.01 [get_ports {iot_out[126]}]
set_load -pin_load 0.01 [get_ports {iot_out[125]}]
set_load -pin_load 0.01 [get_ports {iot_out[124]}]
set_load -pin_load 0.01 [get_ports {iot_out[123]}]
set_load -pin_load 0.01 [get_ports {iot_out[122]}]
set_load -pin_load 0.01 [get_ports {iot_out[121]}]
set_load -pin_load 0.01 [get_ports {iot_out[120]}]
set_load -pin_load 0.01 [get_ports {iot_out[119]}]
set_load -pin_load 0.01 [get_ports {iot_out[118]}]
set_load -pin_load 0.01 [get_ports {iot_out[117]}]
set_load -pin_load 0.01 [get_ports {iot_out[116]}]
set_load -pin_load 0.01 [get_ports {iot_out[115]}]
set_load -pin_load 0.01 [get_ports {iot_out[114]}]
set_load -pin_load 0.01 [get_ports {iot_out[113]}]
set_load -pin_load 0.01 [get_ports {iot_out[112]}]
set_load -pin_load 0.01 [get_ports {iot_out[111]}]
set_load -pin_load 0.01 [get_ports {iot_out[110]}]
set_load -pin_load 0.01 [get_ports {iot_out[109]}]
set_load -pin_load 0.01 [get_ports {iot_out[108]}]
set_load -pin_load 0.01 [get_ports {iot_out[107]}]
set_load -pin_load 0.01 [get_ports {iot_out[106]}]
set_load -pin_load 0.01 [get_ports {iot_out[105]}]
set_load -pin_load 0.01 [get_ports {iot_out[104]}]
set_load -pin_load 0.01 [get_ports {iot_out[103]}]
set_load -pin_load 0.01 [get_ports {iot_out[102]}]
set_load -pin_load 0.01 [get_ports {iot_out[101]}]
set_load -pin_load 0.01 [get_ports {iot_out[100]}]
set_load -pin_load 0.01 [get_ports {iot_out[99]}]
set_load -pin_load 0.01 [get_ports {iot_out[98]}]
set_load -pin_load 0.01 [get_ports {iot_out[97]}]
set_load -pin_load 0.01 [get_ports {iot_out[96]}]
set_load -pin_load 0.01 [get_ports {iot_out[95]}]
set_load -pin_load 0.01 [get_ports {iot_out[94]}]
set_load -pin_load 0.01 [get_ports {iot_out[93]}]
set_load -pin_load 0.01 [get_ports {iot_out[92]}]
set_load -pin_load 0.01 [get_ports {iot_out[91]}]
set_load -pin_load 0.01 [get_ports {iot_out[90]}]
set_load -pin_load 0.01 [get_ports {iot_out[89]}]
set_load -pin_load 0.01 [get_ports {iot_out[88]}]
set_load -pin_load 0.01 [get_ports {iot_out[87]}]
set_load -pin_load 0.01 [get_ports {iot_out[86]}]
set_load -pin_load 0.01 [get_ports {iot_out[85]}]
set_load -pin_load 0.01 [get_ports {iot_out[84]}]
set_load -pin_load 0.01 [get_ports {iot_out[83]}]
set_load -pin_load 0.01 [get_ports {iot_out[82]}]
set_load -pin_load 0.01 [get_ports {iot_out[81]}]
set_load -pin_load 0.01 [get_ports {iot_out[80]}]
set_load -pin_load 0.01 [get_ports {iot_out[79]}]
set_load -pin_load 0.01 [get_ports {iot_out[78]}]
set_load -pin_load 0.01 [get_ports {iot_out[77]}]
set_load -pin_load 0.01 [get_ports {iot_out[76]}]
set_load -pin_load 0.01 [get_ports {iot_out[75]}]
set_load -pin_load 0.01 [get_ports {iot_out[74]}]
set_load -pin_load 0.01 [get_ports {iot_out[73]}]
set_load -pin_load 0.01 [get_ports {iot_out[72]}]
set_load -pin_load 0.01 [get_ports {iot_out[71]}]
set_load -pin_load 0.01 [get_ports {iot_out[70]}]
set_load -pin_load 0.01 [get_ports {iot_out[69]}]
set_load -pin_load 0.01 [get_ports {iot_out[68]}]
set_load -pin_load 0.01 [get_ports {iot_out[67]}]
set_load -pin_load 0.01 [get_ports {iot_out[66]}]
set_load -pin_load 0.01 [get_ports {iot_out[65]}]
set_load -pin_load 0.01 [get_ports {iot_out[64]}]
set_load -pin_load 0.01 [get_ports {iot_out[63]}]
set_load -pin_load 0.01 [get_ports {iot_out[62]}]
set_load -pin_load 0.01 [get_ports {iot_out[61]}]
set_load -pin_load 0.01 [get_ports {iot_out[60]}]
set_load -pin_load 0.01 [get_ports {iot_out[59]}]
set_load -pin_load 0.01 [get_ports {iot_out[58]}]
set_load -pin_load 0.01 [get_ports {iot_out[57]}]
set_load -pin_load 0.01 [get_ports {iot_out[56]}]
set_load -pin_load 0.01 [get_ports {iot_out[55]}]
set_load -pin_load 0.01 [get_ports {iot_out[54]}]
set_load -pin_load 0.01 [get_ports {iot_out[53]}]
set_load -pin_load 0.01 [get_ports {iot_out[52]}]
set_load -pin_load 0.01 [get_ports {iot_out[51]}]
set_load -pin_load 0.01 [get_ports {iot_out[50]}]
set_load -pin_load 0.01 [get_ports {iot_out[49]}]
set_load -pin_load 0.01 [get_ports {iot_out[48]}]
set_load -pin_load 0.01 [get_ports {iot_out[47]}]
set_load -pin_load 0.01 [get_ports {iot_out[46]}]
set_load -pin_load 0.01 [get_ports {iot_out[45]}]
set_load -pin_load 0.01 [get_ports {iot_out[44]}]
set_load -pin_load 0.01 [get_ports {iot_out[43]}]
set_load -pin_load 0.01 [get_ports {iot_out[42]}]
set_load -pin_load 0.01 [get_ports {iot_out[41]}]
set_load -pin_load 0.01 [get_ports {iot_out[40]}]
set_load -pin_load 0.01 [get_ports {iot_out[39]}]
set_load -pin_load 0.01 [get_ports {iot_out[38]}]
set_load -pin_load 0.01 [get_ports {iot_out[37]}]
set_load -pin_load 0.01 [get_ports {iot_out[36]}]
set_load -pin_load 0.01 [get_ports {iot_out[35]}]
set_load -pin_load 0.01 [get_ports {iot_out[34]}]
set_load -pin_load 0.01 [get_ports {iot_out[33]}]
set_load -pin_load 0.01 [get_ports {iot_out[32]}]
set_load -pin_load 0.01 [get_ports {iot_out[31]}]
set_load -pin_load 0.01 [get_ports {iot_out[30]}]
set_load -pin_load 0.01 [get_ports {iot_out[29]}]
set_load -pin_load 0.01 [get_ports {iot_out[28]}]
set_load -pin_load 0.01 [get_ports {iot_out[27]}]
set_load -pin_load 0.01 [get_ports {iot_out[26]}]
set_load -pin_load 0.01 [get_ports {iot_out[25]}]
set_load -pin_load 0.01 [get_ports {iot_out[24]}]
set_load -pin_load 0.01 [get_ports {iot_out[23]}]
set_load -pin_load 0.01 [get_ports {iot_out[22]}]
set_load -pin_load 0.01 [get_ports {iot_out[21]}]
set_load -pin_load 0.01 [get_ports {iot_out[20]}]
set_load -pin_load 0.01 [get_ports {iot_out[19]}]
set_load -pin_load 0.01 [get_ports {iot_out[18]}]
set_load -pin_load 0.01 [get_ports {iot_out[17]}]
set_load -pin_load 0.01 [get_ports {iot_out[16]}]
set_load -pin_load 0.01 [get_ports {iot_out[15]}]
set_load -pin_load 0.01 [get_ports {iot_out[14]}]
set_load -pin_load 0.01 [get_ports {iot_out[13]}]
set_load -pin_load 0.01 [get_ports {iot_out[12]}]
set_load -pin_load 0.01 [get_ports {iot_out[11]}]
set_load -pin_load 0.01 [get_ports {iot_out[10]}]
set_load -pin_load 0.01 [get_ports {iot_out[9]}]
set_load -pin_load 0.01 [get_ports {iot_out[8]}]
set_load -pin_load 0.01 [get_ports {iot_out[7]}]
set_load -pin_load 0.01 [get_ports {iot_out[6]}]
set_load -pin_load 0.01 [get_ports {iot_out[5]}]
set_load -pin_load 0.01 [get_ports {iot_out[4]}]
set_load -pin_load 0.01 [get_ports {iot_out[3]}]
set_load -pin_load 0.01 [get_ports {iot_out[2]}]
set_load -pin_load 0.01 [get_ports {iot_out[1]}]
set_load -pin_load 0.01 [get_ports {iot_out[0]}]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst]
set_max_fanout 10 [get_ports in_en]
set_max_fanout 10 [get_ports {iot_in[7]}]
set_max_fanout 10 [get_ports {iot_in[6]}]
set_max_fanout 10 [get_ports {iot_in[5]}]
set_max_fanout 10 [get_ports {iot_in[4]}]
set_max_fanout 10 [get_ports {iot_in[3]}]
set_max_fanout 10 [get_ports {iot_in[2]}]
set_max_fanout 10 [get_ports {iot_in[1]}]
set_max_fanout 10 [get_ports {iot_in[0]}]
set_max_fanout 10 [get_ports {fn_sel[2]}]
set_max_fanout 10 [get_ports {fn_sel[1]}]
set_max_fanout 10 [get_ports {fn_sel[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 1  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports rst]
set_input_delay -clock clk  -min 0  [get_ports rst]
set_input_delay -clock clk  -max 1  [get_ports in_en]
set_input_delay -clock clk  -min 0  [get_ports in_en]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[7]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[7]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[6]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[6]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[5]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[5]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[4]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[4]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[3]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[2]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[1]}]
set_input_delay -clock clk  -max 1  [get_ports {iot_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {iot_in[0]}]
set_input_delay -clock clk  -max 1  [get_ports {fn_sel[2]}]
set_input_delay -clock clk  -min 0  [get_ports {fn_sel[2]}]
set_input_delay -clock clk  -max 1  [get_ports {fn_sel[1]}]
set_input_delay -clock clk  -min 0  [get_ports {fn_sel[1]}]
set_input_delay -clock clk  -max 1  [get_ports {fn_sel[0]}]
set_input_delay -clock clk  -min 0  [get_ports {fn_sel[0]}]
set_output_delay -clock clk  -max 1  [get_ports busy]
set_output_delay -clock clk  -min 0  [get_ports busy]
set_output_delay -clock clk  -max 1  [get_ports valid]
set_output_delay -clock clk  -min 0  [get_ports valid]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[127]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[127]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[126]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[126]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[125]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[125]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[124]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[124]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[123]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[123]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[122]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[122]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[121]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[121]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[120]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[120]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[119]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[119]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[118]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[118]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[117]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[117]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[116]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[116]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[115]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[115]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[114]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[114]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[113]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[113]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[112]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[112]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[111]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[111]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[110]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[110]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[109]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[109]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[108]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[108]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[107]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[107]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[106]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[106]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[105]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[105]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[104]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[104]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[103]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[103]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[102]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[102]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[101]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[101]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[100]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[100]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[99]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[99]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[98]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[98]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[97]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[97]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[96]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[96]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[95]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[95]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[94]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[94]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[93]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[93]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[92]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[92]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[91]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[91]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[90]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[90]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[89]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[89]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[88]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[88]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[87]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[87]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[86]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[86]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[85]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[85]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[84]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[84]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[83]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[83]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[82]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[82]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[81]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[81]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[80]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[80]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[79]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[79]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[78]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[78]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[77]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[77]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[76]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[76]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[75]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[75]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[74]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[74]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[73]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[73]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[72]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[72]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[71]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[71]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[70]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[70]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[69]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[69]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[68]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[68]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[67]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[67]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[66]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[66]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[65]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[65]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[64]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[64]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[63]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[63]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[62]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[62]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[61]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[61]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[60]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[60]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[59]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[59]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[58]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[58]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[57]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[57]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[56]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[56]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[55]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[55]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[54]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[54]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[53]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[53]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[52]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[52]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[51]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[51]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[50]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[50]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[49]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[49]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[48]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[48]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[47]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[47]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[46]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[46]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[45]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[45]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[44]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[44]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[43]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[43]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[42]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[42]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[41]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[41]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[40]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[40]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[39]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[39]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[38]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[38]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[37]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[37]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[36]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[36]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[35]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[35]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[34]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[34]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[33]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[33]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[32]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[32]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[31]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[31]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[30]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[30]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[29]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[29]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[28]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[28]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[27]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[27]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[26]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[26]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[25]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[25]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[24]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[24]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[23]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[23]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[22]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[22]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[21]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[21]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[20]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[20]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[19]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[19]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[18]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[18]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[17]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[17]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[16]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[16]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[15]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[15]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[14]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[14]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[13]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[13]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[12]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[12]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[11]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[11]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[10]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[10]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[9]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[9]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[8]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[8]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[7]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[7]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[6]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[6]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[5]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[5]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[4]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[4]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[3]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[3]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[2]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[2]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[1]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[1]}]
set_output_delay -clock clk  -max 1  [get_ports {iot_out[0]}]
set_output_delay -clock clk  -min 0  [get_ports {iot_out[0]}]
set_drive 0.1  [get_ports clk]
set_drive 0.1  [get_ports rst]
set_drive 0.1  [get_ports in_en]
set_drive 0.1  [get_ports {iot_in[7]}]
set_drive 0.1  [get_ports {iot_in[6]}]
set_drive 0.1  [get_ports {iot_in[5]}]
set_drive 0.1  [get_ports {iot_in[4]}]
set_drive 0.1  [get_ports {iot_in[3]}]
set_drive 0.1  [get_ports {iot_in[2]}]
set_drive 0.1  [get_ports {iot_in[1]}]
set_drive 0.1  [get_ports {iot_in[0]}]
set_drive 0.1  [get_ports {fn_sel[2]}]
set_drive 0.1  [get_ports {fn_sel[1]}]
set_drive 0.1  [get_ports {fn_sel[0]}]
