###############################################################
#  Generated by:      Cadence Innovus 19.12-s087_1
#  OS:                Linux x86_64(Host ID islabx6)
#  Generated on:      Wed Apr 27 14:33:29 2022
#  Design:            ISE
#  Command:           saveDesign placement.enc
###############################################################
current_design ISE
create_clock [get_ports {clk}]  -name clk -period 50.000000 -waveform {0.000000 25.000000}
set_drive 1  [get_ports {clk}]
set_max_fanout 6  [get_ports {clk}]
set_drive 1  [get_ports {reset}]
set_max_fanout 6  [get_ports {reset}]
set_drive 1  [get_ports {image_in_index[4]}]
set_max_fanout 6  [get_ports {image_in_index[4]}]
set_drive 1  [get_ports {image_in_index[3]}]
set_max_fanout 6  [get_ports {image_in_index[3]}]
set_drive 1  [get_ports {image_in_index[2]}]
set_max_fanout 6  [get_ports {image_in_index[2]}]
set_drive 1  [get_ports {image_in_index[1]}]
set_max_fanout 6  [get_ports {image_in_index[1]}]
set_drive 1  [get_ports {image_in_index[0]}]
set_max_fanout 6  [get_ports {image_in_index[0]}]
set_drive 1  [get_ports {pixel_in[23]}]
set_max_fanout 6  [get_ports {pixel_in[23]}]
set_drive 1  [get_ports {pixel_in[22]}]
set_max_fanout 6  [get_ports {pixel_in[22]}]
set_drive 1  [get_ports {pixel_in[21]}]
set_max_fanout 6  [get_ports {pixel_in[21]}]
set_drive 1  [get_ports {pixel_in[20]}]
set_max_fanout 6  [get_ports {pixel_in[20]}]
set_drive 1  [get_ports {pixel_in[19]}]
set_max_fanout 6  [get_ports {pixel_in[19]}]
set_drive 1  [get_ports {pixel_in[18]}]
set_max_fanout 6  [get_ports {pixel_in[18]}]
set_drive 1  [get_ports {pixel_in[17]}]
set_max_fanout 6  [get_ports {pixel_in[17]}]
set_drive 1  [get_ports {pixel_in[16]}]
set_max_fanout 6  [get_ports {pixel_in[16]}]
set_drive 1  [get_ports {pixel_in[15]}]
set_max_fanout 6  [get_ports {pixel_in[15]}]
set_drive 1  [get_ports {pixel_in[14]}]
set_max_fanout 6  [get_ports {pixel_in[14]}]
set_drive 1  [get_ports {pixel_in[13]}]
set_max_fanout 6  [get_ports {pixel_in[13]}]
set_drive 1  [get_ports {pixel_in[12]}]
set_max_fanout 6  [get_ports {pixel_in[12]}]
set_drive 1  [get_ports {pixel_in[11]}]
set_max_fanout 6  [get_ports {pixel_in[11]}]
set_drive 1  [get_ports {pixel_in[10]}]
set_max_fanout 6  [get_ports {pixel_in[10]}]
set_drive 1  [get_ports {pixel_in[9]}]
set_max_fanout 6  [get_ports {pixel_in[9]}]
set_drive 1  [get_ports {pixel_in[8]}]
set_max_fanout 6  [get_ports {pixel_in[8]}]
set_drive 1  [get_ports {pixel_in[7]}]
set_max_fanout 6  [get_ports {pixel_in[7]}]
set_drive 1  [get_ports {pixel_in[6]}]
set_max_fanout 6  [get_ports {pixel_in[6]}]
set_drive 1  [get_ports {pixel_in[5]}]
set_max_fanout 6  [get_ports {pixel_in[5]}]
set_drive 1  [get_ports {pixel_in[4]}]
set_max_fanout 6  [get_ports {pixel_in[4]}]
set_drive 1  [get_ports {pixel_in[3]}]
set_max_fanout 6  [get_ports {pixel_in[3]}]
set_drive 1  [get_ports {pixel_in[2]}]
set_max_fanout 6  [get_ports {pixel_in[2]}]
set_drive 1  [get_ports {pixel_in[1]}]
set_max_fanout 6  [get_ports {pixel_in[1]}]
set_drive 1  [get_ports {pixel_in[0]}]
set_max_fanout 6  [get_ports {pixel_in[0]}]
set_load -pin_load -max  1  [get_ports {busy}]
set_load -pin_load -min  1  [get_ports {busy}]
set_load -pin_load -max  1  [get_ports {out_valid}]
set_load -pin_load -min  1  [get_ports {out_valid}]
set_load -pin_load -max  1  [get_ports {color_index[1]}]
set_load -pin_load -min  1  [get_ports {color_index[1]}]
set_load -pin_load -max  1  [get_ports {color_index[0]}]
set_load -pin_load -min  1  [get_ports {color_index[0]}]
set_load -pin_load -max  1  [get_ports {image_out_index[4]}]
set_load -pin_load -min  1  [get_ports {image_out_index[4]}]
set_load -pin_load -max  1  [get_ports {image_out_index[3]}]
set_load -pin_load -min  1  [get_ports {image_out_index[3]}]
set_load -pin_load -max  1  [get_ports {image_out_index[2]}]
set_load -pin_load -min  1  [get_ports {image_out_index[2]}]
set_load -pin_load -max  1  [get_ports {image_out_index[1]}]
set_load -pin_load -min  1  [get_ports {image_out_index[1]}]
set_load -pin_load -max  1  [get_ports {image_out_index[0]}]
set_load -pin_load -min  1  [get_ports {image_out_index[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[12]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[10]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_in_index[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[8]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_in_index[1]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[19]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[6]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[17]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[22]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[15]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[20]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[13]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[11]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_in_index[4]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[9]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_in_index[2]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[7]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_in_index[0]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[18]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[5]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[23]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[16]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[3]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[21]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[14]}]
set_input_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {pixel_in[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {busy}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {color_index[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_out_index[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_out_index[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {out_valid}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {color_index[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_out_index[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_out_index[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {clk}] [get_ports {image_out_index[0]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
group_path -name reg2reg -from [get_pins {{index_reg[3][4]/CK} {index_reg[5][4]/CK} {index_reg[7][4]/CK} {index_reg[9][4]/CK} {index_reg[11][4]/CK} {index_reg[13][4]/CK} {index_reg[15][4]/CK} {index_reg[17][4]/CK} {index_reg[19][4]/CK} {index_reg[21][4]/CK} {index_reg[23][4]/CK} {index_reg[25][4]/CK} {index_reg[27][4]/CK} {index_reg[29][4]/CK} {index_reg[3][3]/CK} {index_reg[5][3]/CK} {index_reg[7][3]/CK} {index_reg[9][3]/CK} {index_reg[11][3]/CK} {index_reg[13][3]/CK} {index_reg[15][3]/CK} {index_reg[17][3]/CK} {index_reg[19][3]/CK} {index_reg[21][3]/CK} {index_reg[23][3]/CK} {index_reg[25][3]/CK} {index_reg[27][3]/CK} {index_reg[29][3]/CK} {index_reg[3][2]/CK} {index_reg[5][2]/CK} {index_reg[7][2]/CK} {index_reg[9][2]/CK} {index_reg[11][2]/CK} {index_reg[13][2]/CK} {index_reg[15][2]/CK} {index_reg[17][2]/CK} {index_reg[19][2]/CK} {index_reg[21][2]/CK} {index_reg[23][2]/CK} {index_reg[25][2]/CK} {index_reg[27][2]/CK} {index_reg[29][2]/CK} {index_reg[3][1]/CK} {index_reg[5][1]/CK} {index_reg[7][1]/CK} {index_reg[9][1]/CK} {index_reg[11][1]/CK} {index_reg[13][1]/CK} {index_reg[15][1]/CK} {index_reg[17][1]/CK} {index_reg[19][1]/CK} {index_reg[21][1]/CK} {index_reg[23][1]/CK} {index_reg[25][1]/CK} {index_reg[27][1]/CK} {index_reg[29][1]/CK} {index_reg[3][0]/CK} {index_reg[5][0]/CK} {index_reg[7][0]/CK} {index_reg[9][0]/CK} {index_reg[11][0]/CK} {index_reg[13][0]/CK} {index_reg[15][0]/CK} {index_reg[17][0]/CK} {index_reg[19][0]/CK} {index_reg[21][0]/CK} {index_reg[23][0]/CK} {index_reg[25][0]/CK} {index_reg[27][0]/CK} {index_reg[29][0]/CK} {index_reg[24][4]/CK} {index_reg[4][4]/CK} {index_reg[6][4]/CK} {index_reg[8][4]/CK} {index_reg[10][4]/CK} {index_reg[12][4]/CK} {index_reg[14][4]/CK} {index_reg[16][4]/CK} {index_reg[18][4]/CK} {index_reg[20][4]/CK} {index_reg[22][4]/CK} {index_reg[26][4]/CK} {index_reg[28][4]/CK} {index_reg[30][4]/CK} {index_reg[24][3]/CK} {index_reg[4][3]/CK} {index_reg[6][3]/CK} {index_reg[8][3]/CK} {index_reg[10][3]/CK} {index_reg[12][3]/CK} {index_reg[14][3]/CK} {index_reg[16][3]/CK} {index_reg[18][3]/CK} {index_reg[20][3]/CK} {index_reg[22][3]/CK} {index_reg[26][3]/CK} {index_reg[28][3]/CK} {index_reg[30][3]/CK} {index_reg[24][2]/CK} {index_reg[4][2]/CK} {index_reg[6][2]/CK} {index_reg[8][2]/CK} {index_reg[10][2]/CK} {index_reg[12][2]/CK} {index_reg[14][2]/CK} {index_reg[16][2]/CK} {index_reg[18][2]/CK} {index_reg[20][2]/CK} {index_reg[22][2]/CK} {index_reg[26][2]/CK} {index_reg[28][2]/CK} {index_reg[30][2]/CK} {index_reg[24][1]/CK} {index_reg[4][1]/CK} {index_reg[6][1]/CK} {index_reg[8][1]/CK} {index_reg[10][1]/CK} {index_reg[12][1]/CK} {index_reg[14][1]/CK} {index_reg[16][1]/CK} {index_reg[18][1]/CK} {index_reg[20][1]/CK} {index_reg[22][1]/CK} {index_reg[26][1]/CK} {index_reg[28][1]/CK} {index_reg[30][1]/CK} {index_reg[24][0]/CK} {index_reg[4][0]/CK} {index_reg[6][0]/CK} {index_reg[8][0]/CK} {index_reg[10][0]/CK} {index_reg[12][0]/CK} {index_reg[14][0]/CK} {index_reg[16][0]/CK} {index_reg[18][0]/CK} {index_reg[20][0]/CK} {index_reg[22][0]/CK} {index_reg[26][0]/CK} {index_reg[28][0]/CK} {index_reg[30][0]/CK} {index_reg[1][4]/CK} {index_reg[1][3]/CK} {index_reg[1][2]/CK} {index_reg[1][1]/CK} {index_reg[1][0]/CK} {index_reg[2][4]/CK} {index_reg[2][3]/CK} {index_reg[2][2]/CK} {index_reg[2][1]/CK} {index_reg[2][0]/CK} {index_reg[0][4]/CK} {index_reg[0][3]/CK} {index_reg[0][2]/CK} {index_reg[0][1]/CK} {index_reg[0][0]/CK} {pixel_count_reg[13]/CK} {cur_image_index_reg[1]/CK} {cur_image_index_reg[0]/CK} {cur_image_index_reg[4]/CK} {cur_image_index_reg[2]/CK} {cur_image_index_reg[3]/CK} {pixel_count_reg[10]/CK} {pixel_count_reg[6]/CK} {pixel_count_reg[11]/CK} {pixel_count_reg[7]/CK} {pixel_count_reg[8]/CK} {pixel_count_reg[9]/CK} {pixel_count_reg[12]/CK} {color_reg[1][0]/CK} {color_reg[5][0]/CK} {color_reg[9][0]/CK} {color_reg[15][0]/CK} {color_reg[2][1]/CK} {color_reg[6][1]/CK} {color_reg[10][1]/CK} {color_reg[12][1]/CK} {color_reg[18][1]/CK} {color_reg[22][1]/CK} {color_reg[26][1]/CK} {color_reg[28][1]/CK} {color_reg[2][0]/CK} {color_reg[6][0]/CK} {color_reg[10][0]/CK} {color_reg[12][0]/CK} {color_reg[18][0]/CK} {color_reg[22][0]/CK} {color_reg[26][0]/CK} {color_reg[28][0]/CK} {color_reg[3][1]/CK} {color_reg[7][1]/CK} {color_reg[11][1]/CK} {color_reg[13][1]/CK} {color_reg[19][1]/CK} {color_reg[23][1]/CK} {color_reg[27][1]/CK} {color_reg[29][1]/CK} {color_reg[3][0]/CK} {color_reg[7][0]/CK} {color_reg[11][0]/CK} {color_reg[13][0]/CK} {color_reg[19][0]/CK} {color_reg[23][0]/CK} {color_reg[27][0]/CK} {color_reg[29][0]/CK} {j_reg[1]/CK} {j_reg[2]/CK} {j_reg[0]/CK} {pixel_count_reg[3]/CK} {pixel_count_reg[5]/CK} {pixel_count_reg[4]/CK} {cur_state_reg[0]/CK} {cur_state_reg[1]/CK} {pixel_count_reg[1]/CK} {pixel_count_reg[2]/CK} {pixel_count_reg[0]/CK} {means_reg[24][10]/CK} {means_reg[0][10]/CK} {means_reg[4][10]/CK} {means_reg[8][10]/CK} {means_reg[14][10]/CK} {means_reg[16][10]/CK} {means_reg[20][10]/CK} {means_reg[30][10]/CK} {means_reg[24][9]/CK} {means_reg[0][9]/CK} {means_reg[4][9]/CK} {means_reg[8][9]/CK} {means_reg[14][9]/CK} {means_reg[16][9]/CK} {means_reg[20][9]/CK} {means_reg[30][9]/CK} {means_reg[24][8]/CK} {means_reg[0][8]/CK} {means_reg[4][8]/CK} {means_reg[8][8]/CK} {means_reg[14][8]/CK} {means_reg[16][8]/CK} {means_reg[20][8]/CK} {means_reg[30][8]/CK} {color_reg[24][1]/CK} {color_reg[4][1]/CK} {color_reg[8][1]/CK} {color_reg[14][1]/CK} {color_reg[16][1]/CK} {color_reg[20][1]/CK} {color_reg[30][1]/CK} {color_reg[4][0]/CK} {color_reg[8][0]/CK} {color_reg[14][0]/CK} {color_reg[16][0]/CK} {color_reg[20][0]/CK} {color_reg[24][0]/CK} {color_reg[30][0]/CK} {means_reg[1][10]/CK} {means_reg[5][10]/CK} {means_reg[9][10]/CK} {means_reg[15][10]/CK} {means_reg[17][10]/CK} {means_reg[21][10]/CK} {means_reg[25][10]/CK} {means_reg[1][9]/CK} {means_reg[5][9]/CK} {means_reg[9][9]/CK} {means_reg[15][9]/CK} {means_reg[17][9]/CK} {means_reg[21][9]/CK} {means_reg[25][9]/CK} {means_reg[1][8]/CK} {means_reg[5][8]/CK} {means_reg[9][8]/CK} {means_reg[15][8]/CK} {means_reg[17][8]/CK} {means_reg[21][8]/CK} {means_reg[25][8]/CK} {color_reg[1][1]/CK} {color_reg[5][1]/CK} {color_reg[9][1]/CK} {color_reg[15][1]/CK} {color_reg[17][1]/CK} {color_reg[21][1]/CK} {color_reg[25][1]/CK} {color_reg[17][0]/CK} {color_reg[21][0]/CK} {color_reg[25][0]/CK} {means_reg[2][10]/CK} {means_reg[6][10]/CK} {means_reg[10][10]/CK} {means_reg[12][10]/CK} {means_reg[18][10]/CK} {means_reg[22][10]/CK} {means_reg[26][10]/CK} {means_reg[28][10]/CK} {means_reg[2][9]/CK} {means_reg[6][9]/CK} {means_reg[10][9]/CK} {means_reg[12][9]/CK} {means_reg[18][9]/CK} {means_reg[22][9]/CK} {means_reg[26][9]/CK} {means_reg[28][9]/CK} {means_reg[2][8]/CK} {means_reg[6][8]/CK} {means_reg[10][8]/CK} {means_reg[12][8]/CK} {means_reg[18][8]/CK} {means_reg[22][8]/CK} {means_reg[26][8]/CK} {means_reg[28][8]/CK} {means_reg[2][7]/CK} {means_reg[6][7]/CK} {means_reg[10][7]/CK} {means_reg[12][7]/CK} {means_reg[18][7]/CK} {means_reg[22][7]/CK} {means_reg[26][7]/CK} {means_reg[28][7]/CK} {means_reg[2][6]/CK} {means_reg[6][6]/CK} {means_reg[10][6]/CK} {means_reg[12][6]/CK} {means_reg[18][6]/CK} {means_reg[22][6]/CK} {means_reg[26][6]/CK} {means_reg[28][6]/CK} {means_reg[2][4]/CK} {means_reg[6][4]/CK} {means_reg[10][4]/CK} {means_reg[12][4]/CK} {means_reg[3][10]/CK} {means_reg[7][10]/CK} {means_reg[11][10]/CK} {means_reg[13][10]/CK} {means_reg[19][10]/CK} {means_reg[23][10]/CK} {means_reg[27][10]/CK} {means_reg[29][10]/CK} {means_reg[3][9]/CK} {means_reg[7][9]/CK} {means_reg[11][9]/CK} {means_reg[13][9]/CK} {means_reg[19][9]/CK} {means_reg[23][9]/CK} {means_reg[27][9]/CK} {means_reg[29][9]/CK} {means_reg[3][8]/CK} {means_reg[7][8]/CK} {means_reg[11][8]/CK} {means_reg[13][8]/CK} {means_reg[19][8]/CK} {means_reg[23][8]/CK} {means_reg[27][8]/CK} {means_reg[29][8]/CK} {means_reg[3][7]/CK} {means_reg[7][7]/CK} {means_reg[11][7]/CK} {means_reg[13][7]/CK} {means_reg[19][7]/CK} {means_reg[23][7]/CK} {means_reg[27][7]/CK} {means_reg[29][7]/CK} {means_reg[3][6]/CK} {means_reg[7][6]/CK} {means_reg[11][6]/CK} {means_reg[13][6]/CK} {means_reg[19][6]/CK} {means_reg[23][6]/CK} {means_reg[27][6]/CK} {means_reg[29][6]/CK} {means_reg[11][4]/CK} {means_reg[13][4]/CK} {j_reg[3]/CK} {j_reg[4]/CK} \
{means_reg[24][7]/CK} {means_reg[0][7]/CK} {means_reg[4][7]/CK} {means_reg[8][7]/CK} {means_reg[14][7]/CK} {means_reg[16][7]/CK} {means_reg[20][7]/CK} {means_reg[30][7]/CK} {means_reg[24][6]/CK} {means_reg[0][6]/CK} {means_reg[4][6]/CK} {means_reg[8][6]/CK} {means_reg[14][6]/CK} {means_reg[16][6]/CK} {means_reg[20][6]/CK} {means_reg[30][6]/CK} {means_reg[24][5]/CK} {means_reg[0][5]/CK} {means_reg[4][5]/CK} {means_reg[8][5]/CK} {means_reg[14][5]/CK} {means_reg[16][5]/CK} {means_reg[20][5]/CK} {means_reg[30][5]/CK} {means_reg[24][4]/CK} {means_reg[0][4]/CK} {means_reg[4][4]/CK} {means_reg[8][4]/CK} {means_reg[14][4]/CK} {means_reg[16][4]/CK} {means_reg[20][4]/CK} {means_reg[30][4]/CK} {means_reg[24][3]/CK} {means_reg[0][3]/CK} {means_reg[4][3]/CK} {means_reg[8][3]/CK} {means_reg[14][3]/CK} {means_reg[16][3]/CK} {means_reg[20][3]/CK} {means_reg[30][3]/CK} {means_reg[24][2]/CK} {means_reg[0][2]/CK} {means_reg[4][2]/CK} {means_reg[8][2]/CK} {means_reg[14][2]/CK} {means_reg[16][2]/CK} {means_reg[20][2]/CK} {means_reg[30][2]/CK} {means_reg[24][1]/CK} {means_reg[0][1]/CK} {means_reg[4][1]/CK} {means_reg[8][1]/CK} {means_reg[14][1]/CK} {means_reg[16][1]/CK} {means_reg[20][1]/CK} {means_reg[30][1]/CK} {means_reg[24][0]/CK} {means_reg[0][0]/CK} {means_reg[4][0]/CK} {means_reg[8][0]/CK} {means_reg[14][0]/CK} {means_reg[16][0]/CK} {means_reg[20][0]/CK} {means_reg[30][0]/CK} {means_reg[1][7]/CK} {means_reg[5][7]/CK} {means_reg[9][7]/CK} {means_reg[15][7]/CK} {means_reg[17][7]/CK} {means_reg[21][7]/CK} {means_reg[25][7]/CK} {means_reg[1][6]/CK} {means_reg[5][6]/CK} {means_reg[9][6]/CK} {means_reg[15][6]/CK} {means_reg[17][6]/CK} {means_reg[21][6]/CK} {means_reg[25][6]/CK} {means_reg[1][5]/CK} {means_reg[5][5]/CK} {means_reg[9][5]/CK} {means_reg[15][5]/CK} {means_reg[17][5]/CK} {means_reg[21][5]/CK} {means_reg[25][5]/CK} {means_reg[1][4]/CK} {means_reg[5][4]/CK} {means_reg[9][4]/CK} {means_reg[15][4]/CK} {means_reg[17][4]/CK} {means_reg[21][4]/CK} {means_reg[25][4]/CK} {means_reg[1][3]/CK} {means_reg[5][3]/CK} {means_reg[9][3]/CK} {means_reg[15][3]/CK} {means_reg[17][3]/CK} {means_reg[21][3]/CK} {means_reg[25][3]/CK} {means_reg[1][2]/CK} {means_reg[5][2]/CK} {means_reg[9][2]/CK} {means_reg[15][2]/CK} {means_reg[17][2]/CK} {means_reg[21][2]/CK} {means_reg[25][2]/CK} {means_reg[1][1]/CK} {means_reg[5][1]/CK} {means_reg[9][1]/CK} {means_reg[15][1]/CK} {means_reg[17][1]/CK} {means_reg[21][1]/CK} {means_reg[25][1]/CK} {means_reg[1][0]/CK} {means_reg[5][0]/CK} {means_reg[9][0]/CK} {means_reg[15][0]/CK} {means_reg[17][0]/CK} {means_reg[21][0]/CK} {means_reg[25][0]/CK} {means_reg[2][5]/CK} {means_reg[6][5]/CK} {means_reg[10][5]/CK} {means_reg[12][5]/CK} {means_reg[18][5]/CK} {means_reg[22][5]/CK} {means_reg[26][5]/CK} {means_reg[28][5]/CK} {means_reg[18][4]/CK} {means_reg[22][4]/CK} {means_reg[26][4]/CK} {means_reg[28][4]/CK} {means_reg[2][3]/CK} {means_reg[6][3]/CK} {means_reg[10][3]/CK} {means_reg[12][3]/CK} {means_reg[18][3]/CK} {means_reg[22][3]/CK} {means_reg[26][3]/CK} {means_reg[28][3]/CK} {means_reg[2][2]/CK} {means_reg[6][2]/CK} {means_reg[10][2]/CK} {means_reg[12][2]/CK} {means_reg[18][2]/CK} {means_reg[22][2]/CK} {means_reg[26][2]/CK} {means_reg[28][2]/CK} {means_reg[2][1]/CK} {means_reg[6][1]/CK} {means_reg[10][1]/CK} {means_reg[12][1]/CK} {means_reg[18][1]/CK} {means_reg[22][1]/CK} {means_reg[26][1]/CK} {means_reg[28][1]/CK} {means_reg[2][0]/CK} {means_reg[6][0]/CK} {means_reg[10][0]/CK} {means_reg[12][0]/CK} {means_reg[18][0]/CK} {means_reg[22][0]/CK} {means_reg[26][0]/CK} {means_reg[28][0]/CK} {means_reg[3][5]/CK} {means_reg[7][5]/CK} {means_reg[11][5]/CK} {means_reg[13][5]/CK} {means_reg[19][5]/CK} {means_reg[23][5]/CK} {means_reg[27][5]/CK} {means_reg[29][5]/CK} {means_reg[3][4]/CK} {means_reg[7][4]/CK} {means_reg[19][4]/CK} {means_reg[23][4]/CK} {means_reg[27][4]/CK} {means_reg[29][4]/CK} {means_reg[3][3]/CK} {means_reg[7][3]/CK} {means_reg[11][3]/CK} {means_reg[13][3]/CK} {means_reg[19][3]/CK} {means_reg[23][3]/CK} {means_reg[27][3]/CK} {means_reg[29][3]/CK} {means_reg[3][2]/CK} {means_reg[7][2]/CK} {means_reg[11][2]/CK} {means_reg[13][2]/CK} {means_reg[19][2]/CK} {means_reg[23][2]/CK} {means_reg[27][2]/CK} {means_reg[29][2]/CK} {means_reg[3][1]/CK} {means_reg[7][1]/CK} {means_reg[11][1]/CK} {means_reg[13][1]/CK} {means_reg[19][1]/CK} {means_reg[23][1]/CK} {means_reg[27][1]/CK} {means_reg[29][1]/CK} {means_reg[3][0]/CK} {means_reg[7][0]/CK} {means_reg[11][0]/CK} {means_reg[13][0]/CK} {means_reg[19][0]/CK} {means_reg[23][0]/CK} {means_reg[27][0]/CK} {means_reg[29][0]/CK} {sum_reg[2][0]/CK} {sum_reg[0][0]/CK} {sum_reg[1][0]/CK} {sum_reg[1][1]/CK} {sum_reg[2][1]/CK} {sum_reg[0][1]/CK} {sum_reg[2][2]/CK} {sum_reg[0][2]/CK} {sum_reg[1][2]/CK} {sum_reg[2][3]/CK} {sum_reg[0][3]/CK} {sum_reg[1][3]/CK} {sum_reg[2][4]/CK} {sum_reg[0][4]/CK} {sum_reg[1][4]/CK} {sum_reg[1][5]/CK} {sum_reg[2][5]/CK} {sum_reg[0][5]/CK} {sum_reg[2][6]/CK} {sum_reg[0][6]/CK} {sum_reg[1][6]/CK} {sum_reg[2][7]/CK} {sum_reg[0][7]/CK} {sum_reg[1][7]/CK} {sum_reg[2][8]/CK} {sum_reg[0][8]/CK} {sum_reg[1][8]/CK} {sum_reg[2][9]/CK} {sum_reg[0][9]/CK} {sum_reg[1][9]/CK} {sum_reg[2][10]/CK} {sum_reg[0][10]/CK} {sum_reg[1][10]/CK} {sum_reg[2][11]/CK} {sum_reg[0][11]/CK} {sum_reg[1][11]/CK} {sum_reg[2][12]/CK} {sum_reg[0][12]/CK} {sum_reg[1][12]/CK} {sum_reg[1][13]/CK} {sum_reg[2][13]/CK} {sum_reg[0][13]/CK} {sum_reg[2][14]/CK} {sum_reg[0][14]/CK} {sum_reg[1][14]/CK} {sum_reg[2][15]/CK} {sum_reg[0][15]/CK} {sum_reg[1][15]/CK} {sum_reg[2][16]/CK} {sum_reg[0][16]/CK} {sum_reg[1][16]/CK} {sum_reg[2][17]/CK} {sum_reg[0][17]/CK} {sum_reg[1][17]/CK} {sum_reg[2][18]/CK} {sum_reg[0][18]/CK} {sum_reg[1][18]/CK} {sum_reg[2][19]/CK} {sum_reg[0][19]/CK} {sum_reg[1][19]/CK} {sum_reg[1][20]/CK} {sum_reg[2][21]/CK} {sum_reg[0][21]/CK} {sum_reg[1][21]/CK} {sum_reg[2][20]/CK} {sum_reg[0][20]/CK} out_valid_reg/CK busy_reg/CK {image_out_index_reg[4]/CK} {image_out_index_reg[3]/CK} {image_out_index_reg[2]/CK} {image_out_index_reg[1]/CK} {image_out_index_reg[0]/CK} {color_index_reg[1]/CK} {color_index_reg[0]/CK} {color_reg[0][0]/CK} {color_reg[0][1]/CK} {index_reg[31][4]/CK} {index_reg[31][3]/CK} {index_reg[31][2]/CK} {index_reg[31][1]/CK} {index_reg[31][0]/CK} {color_reg[31][0]/CK} {color_reg[31][1]/CK} {means_reg[31][10]/CK} {means_reg[31][9]/CK} {means_reg[31][8]/CK} {means_reg[31][7]/CK} {means_reg[31][6]/CK} {means_reg[31][5]/CK} {means_reg[31][4]/CK} {means_reg[31][3]/CK} {means_reg[31][2]/CK} {means_reg[31][1]/CK} {means_reg[31][0]/CK} {cur_state_reg[2]/CK} {cnt_reg[0][14]/CK} {cnt_reg[0][13]/CK} {cnt_reg[0][12]/CK} {cnt_reg[0][11]/CK} {cnt_reg[0][10]/CK} {cnt_reg[0][9]/CK} {cnt_reg[0][8]/CK} {cnt_reg[0][7]/CK} {cnt_reg[0][6]/CK} {cnt_reg[0][5]/CK} {cnt_reg[0][4]/CK} {cnt_reg[0][3]/CK} {cnt_reg[0][2]/CK} {cnt_reg[0][1]/CK} {cnt_reg[0][0]/CK} {cnt_reg[1][14]/CK} {cnt_reg[1][13]/CK} {cnt_reg[1][12]/CK} {cnt_reg[1][11]/CK} {cnt_reg[1][10]/CK} {cnt_reg[1][9]/CK} {cnt_reg[1][8]/CK} {cnt_reg[1][7]/CK} {cnt_reg[1][6]/CK} {cnt_reg[1][5]/CK} {cnt_reg[1][4]/CK} {cnt_reg[1][3]/CK} {cnt_reg[1][2]/CK} {cnt_reg[1][1]/CK} {cnt_reg[1][0]/CK} {cnt_reg[2][14]/CK} {cnt_reg[2][13]/CK} {cnt_reg[2][12]/CK} {cnt_reg[2][11]/CK} {cnt_reg[2][10]/CK} {cnt_reg[2][9]/CK} {cnt_reg[2][8]/CK} {cnt_reg[2][7]/CK} {cnt_reg[2][6]/CK} {cnt_reg[2][5]/CK} {cnt_reg[2][4]/CK} {cnt_reg[2][3]/CK} {cnt_reg[2][2]/CK} {cnt_reg[2][1]/CK} {cnt_reg[2][0]/CK} {i_reg[3]/CK} {i_reg[2]/CK} {i_reg[4]/CK} {i_reg[0]/CK} {i_reg[1]/CK}}]  -to [get_pins {{index_reg[3][4]/D} {index_reg[3][4]/E} {index_reg[5][4]/D} {index_reg[5][4]/E} {index_reg[7][4]/D} {index_reg[7][4]/E} {index_reg[9][4]/D} {index_reg[9][4]/E} {index_reg[11][4]/D} {index_reg[11][4]/E} {index_reg[13][4]/D} {index_reg[13][4]/E} {index_reg[15][4]/D} {index_reg[15][4]/E} {index_reg[17][4]/D} {index_reg[17][4]/E} {index_reg[19][4]/D} {index_reg[19][4]/E} {index_reg[21][4]/D} {index_reg[21][4]/E} {index_reg[23][4]/D} {index_reg[23][4]/E} {index_reg[25][4]/D} {index_reg[25][4]/E} {index_reg[27][4]/D} {index_reg[27][4]/E} {index_reg[29][4]/D} {index_reg[29][4]/E} {index_reg[3][3]/D} {index_reg[3][3]/E} {index_reg[5][3]/D} {index_reg[5][3]/E} {index_reg[7][3]/D} {index_reg[7][3]/E} \
{index_reg[9][3]/D} {index_reg[9][3]/E} {index_reg[11][3]/D} {index_reg[11][3]/E} {index_reg[13][3]/D} {index_reg[13][3]/E} {index_reg[15][3]/D} {index_reg[15][3]/E} {index_reg[17][3]/D} {index_reg[17][3]/E} {index_reg[19][3]/D} {index_reg[19][3]/E} {index_reg[21][3]/D} {index_reg[21][3]/E} {index_reg[23][3]/D} {index_reg[23][3]/E} {index_reg[25][3]/D} {index_reg[25][3]/E} {index_reg[27][3]/D} {index_reg[27][3]/E} {index_reg[29][3]/D} {index_reg[29][3]/E} {index_reg[3][2]/D} {index_reg[3][2]/E} {index_reg[5][2]/D} {index_reg[5][2]/E} {index_reg[7][2]/D} {index_reg[7][2]/E} {index_reg[9][2]/D} {index_reg[9][2]/E} {index_reg[11][2]/D} {index_reg[11][2]/E} {index_reg[13][2]/D} {index_reg[13][2]/E} {index_reg[15][2]/D} {index_reg[15][2]/E} {index_reg[17][2]/D} {index_reg[17][2]/E} {index_reg[19][2]/D} {index_reg[19][2]/E} {index_reg[21][2]/D} {index_reg[21][2]/E} {index_reg[23][2]/D} {index_reg[23][2]/E} {index_reg[25][2]/D} {index_reg[25][2]/E} {index_reg[27][2]/D} {index_reg[27][2]/E} {index_reg[29][2]/D} {index_reg[29][2]/E} {index_reg[3][1]/D} {index_reg[3][1]/E} {index_reg[5][1]/D} {index_reg[5][1]/E} {index_reg[7][1]/D} {index_reg[7][1]/E} {index_reg[9][1]/D} {index_reg[9][1]/E} {index_reg[11][1]/D} {index_reg[11][1]/E} {index_reg[13][1]/D} {index_reg[13][1]/E} {index_reg[15][1]/D} {index_reg[15][1]/E} {index_reg[17][1]/D} {index_reg[17][1]/E} {index_reg[19][1]/D} {index_reg[19][1]/E} {index_reg[21][1]/D} {index_reg[21][1]/E} {index_reg[23][1]/D} {index_reg[23][1]/E} {index_reg[25][1]/D} {index_reg[25][1]/E} {index_reg[27][1]/D} {index_reg[27][1]/E} {index_reg[29][1]/D} {index_reg[29][1]/E} {index_reg[3][0]/D} {index_reg[3][0]/E} {index_reg[5][0]/D} {index_reg[5][0]/E} {index_reg[7][0]/D} {index_reg[7][0]/E} {index_reg[9][0]/D} {index_reg[9][0]/E} {index_reg[11][0]/D} {index_reg[11][0]/E} {index_reg[13][0]/D} {index_reg[13][0]/E} {index_reg[15][0]/D} {index_reg[15][0]/E} {index_reg[17][0]/D} {index_reg[17][0]/E} {index_reg[19][0]/D} {index_reg[19][0]/E} {index_reg[21][0]/D} {index_reg[21][0]/E} {index_reg[23][0]/D} {index_reg[23][0]/E} {index_reg[25][0]/D} {index_reg[25][0]/E} {index_reg[27][0]/D} {index_reg[27][0]/E} {index_reg[29][0]/D} {index_reg[29][0]/E} {index_reg[24][4]/D} {index_reg[24][4]/E} {index_reg[4][4]/D} {index_reg[4][4]/E} {index_reg[6][4]/D} {index_reg[6][4]/E} {index_reg[8][4]/D} {index_reg[8][4]/E} {index_reg[10][4]/D} {index_reg[10][4]/E} {index_reg[12][4]/D} {index_reg[12][4]/E} {index_reg[14][4]/D} {index_reg[14][4]/E} {index_reg[16][4]/D} {index_reg[16][4]/E} {index_reg[18][4]/D} {index_reg[18][4]/E} {index_reg[20][4]/D} {index_reg[20][4]/E} {index_reg[22][4]/D} {index_reg[22][4]/E} {index_reg[26][4]/D} {index_reg[26][4]/E} {index_reg[28][4]/D} {index_reg[28][4]/E} {index_reg[30][4]/D} {index_reg[30][4]/E} {index_reg[24][3]/D} {index_reg[24][3]/E} {index_reg[4][3]/D} {index_reg[4][3]/E} {index_reg[6][3]/D} {index_reg[6][3]/E} {index_reg[8][3]/D} {index_reg[8][3]/E} {index_reg[10][3]/D} {index_reg[10][3]/E} {index_reg[12][3]/D} {index_reg[12][3]/E} {index_reg[14][3]/D} {index_reg[14][3]/E} {index_reg[16][3]/D} {index_reg[16][3]/E} {index_reg[18][3]/D} {index_reg[18][3]/E} {index_reg[20][3]/D} {index_reg[20][3]/E} {index_reg[22][3]/D} {index_reg[22][3]/E} {index_reg[26][3]/D} {index_reg[26][3]/E} {index_reg[28][3]/D} {index_reg[28][3]/E} {index_reg[30][3]/D} {index_reg[30][3]/E} {index_reg[24][2]/D} {index_reg[24][2]/E} {index_reg[4][2]/D} {index_reg[4][2]/E} {index_reg[6][2]/D} {index_reg[6][2]/E} {index_reg[8][2]/D} {index_reg[8][2]/E} {index_reg[10][2]/D} {index_reg[10][2]/E} {index_reg[12][2]/D} {index_reg[12][2]/E} {index_reg[14][2]/D} {index_reg[14][2]/E} {index_reg[16][2]/D} {index_reg[16][2]/E} {index_reg[18][2]/D} {index_reg[18][2]/E} {index_reg[20][2]/D} {index_reg[20][2]/E} {index_reg[22][2]/D} {index_reg[22][2]/E} {index_reg[26][2]/D} {index_reg[26][2]/E} {index_reg[28][2]/D} {index_reg[28][2]/E} {index_reg[30][2]/D} {index_reg[30][2]/E} {index_reg[24][1]/D} {index_reg[24][1]/E} {index_reg[4][1]/D} {index_reg[4][1]/E} {index_reg[6][1]/D} {index_reg[6][1]/E} {index_reg[8][1]/D} {index_reg[8][1]/E} {index_reg[10][1]/D} {index_reg[10][1]/E} {index_reg[12][1]/D} {index_reg[12][1]/E} {index_reg[14][1]/D} {index_reg[14][1]/E} {index_reg[16][1]/D} {index_reg[16][1]/E} {index_reg[18][1]/D} {index_reg[18][1]/E} {index_reg[20][1]/D} {index_reg[20][1]/E} {index_reg[22][1]/D} {index_reg[22][1]/E} {index_reg[26][1]/D} {index_reg[26][1]/E} {index_reg[28][1]/D} {index_reg[28][1]/E} {index_reg[30][1]/D} {index_reg[30][1]/E} {index_reg[24][0]/D} {index_reg[24][0]/E} {index_reg[4][0]/D} {index_reg[4][0]/E} {index_reg[6][0]/D} {index_reg[6][0]/E} {index_reg[8][0]/D} {index_reg[8][0]/E} {index_reg[10][0]/D} {index_reg[10][0]/E} {index_reg[12][0]/D} {index_reg[12][0]/E} {index_reg[14][0]/D} {index_reg[14][0]/E} {index_reg[16][0]/D} {index_reg[16][0]/E} {index_reg[18][0]/D} {index_reg[18][0]/E} {index_reg[20][0]/D} {index_reg[20][0]/E} {index_reg[22][0]/D} {index_reg[22][0]/E} {index_reg[26][0]/D} {index_reg[26][0]/E} {index_reg[28][0]/D} {index_reg[28][0]/E} {index_reg[30][0]/D} {index_reg[30][0]/E} {index_reg[1][4]/D} {index_reg[1][4]/E} {index_reg[1][3]/D} {index_reg[1][3]/E} {index_reg[1][2]/D} {index_reg[1][2]/E} {index_reg[1][1]/D} {index_reg[1][1]/E} {index_reg[1][0]/D} {index_reg[1][0]/E} {index_reg[2][4]/D} {index_reg[2][4]/E} {index_reg[2][3]/D} {index_reg[2][3]/E} {index_reg[2][2]/D} {index_reg[2][2]/E} {index_reg[2][1]/D} {index_reg[2][1]/E} {index_reg[2][0]/D} {index_reg[2][0]/E} {index_reg[0][4]/D} {index_reg[0][4]/E} {index_reg[0][3]/D} {index_reg[0][3]/E} {index_reg[0][2]/D} {index_reg[0][2]/E} {index_reg[0][1]/D} {index_reg[0][1]/E} {index_reg[0][0]/D} {index_reg[0][0]/E} {pixel_count_reg[13]/D} {pixel_count_reg[13]/RN} {cur_image_index_reg[1]/D} {cur_image_index_reg[1]/E} {cur_image_index_reg[0]/D} {cur_image_index_reg[0]/E} {cur_image_index_reg[4]/D} {cur_image_index_reg[4]/E} {cur_image_index_reg[2]/D} {cur_image_index_reg[2]/E} {cur_image_index_reg[3]/D} {cur_image_index_reg[3]/E} {pixel_count_reg[10]/D} {pixel_count_reg[10]/RN} {pixel_count_reg[6]/D} {pixel_count_reg[6]/RN} {pixel_count_reg[11]/D} {pixel_count_reg[11]/RN} {pixel_count_reg[7]/D} {pixel_count_reg[7]/RN} {pixel_count_reg[8]/D} {pixel_count_reg[8]/RN} {pixel_count_reg[9]/D} {pixel_count_reg[9]/RN} {pixel_count_reg[12]/D} {pixel_count_reg[12]/RN} {color_reg[1][0]/D} {color_reg[1][0]/E} {color_reg[5][0]/D} {color_reg[5][0]/E} {color_reg[9][0]/D} {color_reg[9][0]/E} {color_reg[15][0]/D} {color_reg[15][0]/E} {color_reg[2][1]/D} {color_reg[2][1]/E} {color_reg[6][1]/D} {color_reg[6][1]/E} {color_reg[10][1]/D} {color_reg[10][1]/E} {color_reg[12][1]/D} {color_reg[12][1]/E} {color_reg[18][1]/D} {color_reg[18][1]/E} {color_reg[22][1]/D} {color_reg[22][1]/E} {color_reg[26][1]/D} {color_reg[26][1]/E} {color_reg[28][1]/D} {color_reg[28][1]/E} {color_reg[2][0]/D} {color_reg[2][0]/E} {color_reg[6][0]/D} {color_reg[6][0]/E} {color_reg[10][0]/D} {color_reg[10][0]/E} {color_reg[12][0]/D} {color_reg[12][0]/E} {color_reg[18][0]/D} {color_reg[18][0]/E} {color_reg[22][0]/D} {color_reg[22][0]/E} {color_reg[26][0]/D} {color_reg[26][0]/E} {color_reg[28][0]/D} {color_reg[28][0]/E} {color_reg[3][1]/D} {color_reg[3][1]/E} {color_reg[7][1]/D} {color_reg[7][1]/E} {color_reg[11][1]/D} {color_reg[11][1]/E} {color_reg[13][1]/D} {color_reg[13][1]/E} {color_reg[19][1]/D} {color_reg[19][1]/E} {color_reg[23][1]/D} {color_reg[23][1]/E} {color_reg[27][1]/D} {color_reg[27][1]/E} {color_reg[29][1]/D} {color_reg[29][1]/E} {color_reg[3][0]/D} {color_reg[3][0]/E} {color_reg[7][0]/D} {color_reg[7][0]/E} {color_reg[11][0]/D} {color_reg[11][0]/E} {color_reg[13][0]/D} {color_reg[13][0]/E} {color_reg[19][0]/D} {color_reg[19][0]/E} {color_reg[23][0]/D} {color_reg[23][0]/E} {color_reg[27][0]/D} {color_reg[27][0]/E} {color_reg[29][0]/D} {color_reg[29][0]/E} {j_reg[1]/D} {j_reg[2]/D} {j_reg[0]/D} {pixel_count_reg[3]/D} {pixel_count_reg[3]/RN} {pixel_count_reg[5]/D} {pixel_count_reg[5]/RN} {pixel_count_reg[4]/D} {pixel_count_reg[4]/RN} {cur_state_reg[0]/D} {cur_state_reg[0]/RN} {cur_state_reg[1]/D} {cur_state_reg[1]/RN} {pixel_count_reg[1]/D} {pixel_count_reg[1]/RN} {pixel_count_reg[2]/D} \
{pixel_count_reg[2]/RN} {pixel_count_reg[0]/D} {pixel_count_reg[0]/RN} {means_reg[24][10]/D} {means_reg[24][10]/E} {means_reg[0][10]/D} {means_reg[0][10]/E} {means_reg[4][10]/D} {means_reg[4][10]/E} {means_reg[8][10]/D} {means_reg[8][10]/E} {means_reg[14][10]/D} {means_reg[14][10]/E} {means_reg[16][10]/D} {means_reg[16][10]/E} {means_reg[20][10]/D} {means_reg[20][10]/E} {means_reg[30][10]/D} {means_reg[30][10]/E} {means_reg[24][9]/D} {means_reg[24][9]/E} {means_reg[0][9]/D} {means_reg[0][9]/E} {means_reg[4][9]/D} {means_reg[4][9]/E} {means_reg[8][9]/D} {means_reg[8][9]/E} {means_reg[14][9]/D} {means_reg[14][9]/E} {means_reg[16][9]/D} {means_reg[16][9]/E} {means_reg[20][9]/D} {means_reg[20][9]/E} {means_reg[30][9]/D} {means_reg[30][9]/E} {means_reg[24][8]/D} {means_reg[24][8]/E} {means_reg[0][8]/D} {means_reg[0][8]/E} {means_reg[4][8]/D} {means_reg[4][8]/E} {means_reg[8][8]/D} {means_reg[8][8]/E} {means_reg[14][8]/D} {means_reg[14][8]/E} {means_reg[16][8]/D} {means_reg[16][8]/E} {means_reg[20][8]/D} {means_reg[20][8]/E} {means_reg[30][8]/D} {means_reg[30][8]/E} {color_reg[24][1]/D} {color_reg[24][1]/E} {color_reg[4][1]/D} {color_reg[4][1]/E} {color_reg[8][1]/D} {color_reg[8][1]/E} {color_reg[14][1]/D} {color_reg[14][1]/E} {color_reg[16][1]/D} {color_reg[16][1]/E} {color_reg[20][1]/D} {color_reg[20][1]/E} {color_reg[30][1]/D} {color_reg[30][1]/E} {color_reg[4][0]/D} {color_reg[4][0]/E} {color_reg[8][0]/D} {color_reg[8][0]/E} {color_reg[14][0]/D} {color_reg[14][0]/E} {color_reg[16][0]/D} {color_reg[16][0]/E} {color_reg[20][0]/D} {color_reg[20][0]/E} {color_reg[24][0]/D} {color_reg[24][0]/E} {color_reg[30][0]/D} {color_reg[30][0]/E} {means_reg[1][10]/D} {means_reg[1][10]/E} {means_reg[5][10]/D} {means_reg[5][10]/E} {means_reg[9][10]/D} {means_reg[9][10]/E} {means_reg[15][10]/D} {means_reg[15][10]/E} {means_reg[17][10]/D} {means_reg[17][10]/E} {means_reg[21][10]/D} {means_reg[21][10]/E} {means_reg[25][10]/D} {means_reg[25][10]/E} {means_reg[1][9]/D} {means_reg[1][9]/E} {means_reg[5][9]/D} {means_reg[5][9]/E} {means_reg[9][9]/D} {means_reg[9][9]/E} {means_reg[15][9]/D} {means_reg[15][9]/E} {means_reg[17][9]/D} {means_reg[17][9]/E} {means_reg[21][9]/D} {means_reg[21][9]/E} {means_reg[25][9]/D} {means_reg[25][9]/E} {means_reg[1][8]/D} {means_reg[1][8]/E} {means_reg[5][8]/D} {means_reg[5][8]/E} {means_reg[9][8]/D} {means_reg[9][8]/E} {means_reg[15][8]/D} {means_reg[15][8]/E} {means_reg[17][8]/D} {means_reg[17][8]/E} {means_reg[21][8]/D} {means_reg[21][8]/E} {means_reg[25][8]/D} {means_reg[25][8]/E} {color_reg[1][1]/D} {color_reg[1][1]/E} {color_reg[5][1]/D} {color_reg[5][1]/E} {color_reg[9][1]/D} {color_reg[9][1]/E} {color_reg[15][1]/D} {color_reg[15][1]/E} {color_reg[17][1]/D} {color_reg[17][1]/E} {color_reg[21][1]/D} {color_reg[21][1]/E} {color_reg[25][1]/D} {color_reg[25][1]/E} {color_reg[17][0]/D} {color_reg[17][0]/E} {color_reg[21][0]/D} {color_reg[21][0]/E} {color_reg[25][0]/D} {color_reg[25][0]/E} {means_reg[2][10]/D} {means_reg[2][10]/E} {means_reg[6][10]/D} {means_reg[6][10]/E} {means_reg[10][10]/D} {means_reg[10][10]/E} {means_reg[12][10]/D} {means_reg[12][10]/E} {means_reg[18][10]/D} {means_reg[18][10]/E} {means_reg[22][10]/D} {means_reg[22][10]/E} {means_reg[26][10]/D} {means_reg[26][10]/E} {means_reg[28][10]/D} {means_reg[28][10]/E} {means_reg[2][9]/D} {means_reg[2][9]/E} {means_reg[6][9]/D} {means_reg[6][9]/E} {means_reg[10][9]/D} {means_reg[10][9]/E} {means_reg[12][9]/D} {means_reg[12][9]/E} {means_reg[18][9]/D} {means_reg[18][9]/E} {means_reg[22][9]/D} {means_reg[22][9]/E} {means_reg[26][9]/D} {means_reg[26][9]/E} {means_reg[28][9]/D} {means_reg[28][9]/E} {means_reg[2][8]/D} {means_reg[2][8]/E} {means_reg[6][8]/D} {means_reg[6][8]/E} {means_reg[10][8]/D} {means_reg[10][8]/E} {means_reg[12][8]/D} {means_reg[12][8]/E} {means_reg[18][8]/D} {means_reg[18][8]/E} {means_reg[22][8]/D} {means_reg[22][8]/E} {means_reg[26][8]/D} {means_reg[26][8]/E} {means_reg[28][8]/D} {means_reg[28][8]/E} {means_reg[2][7]/D} {means_reg[2][7]/E} {means_reg[6][7]/D} {means_reg[6][7]/E} {means_reg[10][7]/D} {means_reg[10][7]/E} {means_reg[12][7]/D} {means_reg[12][7]/E} {means_reg[18][7]/D} {means_reg[18][7]/E} {means_reg[22][7]/D} {means_reg[22][7]/E} {means_reg[26][7]/D} {means_reg[26][7]/E} {means_reg[28][7]/D} {means_reg[28][7]/E} {means_reg[2][6]/D} {means_reg[2][6]/E} {means_reg[6][6]/D} {means_reg[6][6]/E} {means_reg[10][6]/D} {means_reg[10][6]/E} {means_reg[12][6]/D} {means_reg[12][6]/E} {means_reg[18][6]/D} {means_reg[18][6]/E} {means_reg[22][6]/D} {means_reg[22][6]/E} {means_reg[26][6]/D} {means_reg[26][6]/E} {means_reg[28][6]/D} {means_reg[28][6]/E} {means_reg[2][4]/D} {means_reg[2][4]/E} {means_reg[6][4]/D} {means_reg[6][4]/E} {means_reg[10][4]/D} {means_reg[10][4]/E} {means_reg[12][4]/D} {means_reg[12][4]/E} {means_reg[3][10]/D} {means_reg[3][10]/E} {means_reg[7][10]/D} {means_reg[7][10]/E} {means_reg[11][10]/D} {means_reg[11][10]/E} {means_reg[13][10]/D} {means_reg[13][10]/E} {means_reg[19][10]/D} {means_reg[19][10]/E} {means_reg[23][10]/D} {means_reg[23][10]/E} {means_reg[27][10]/D} {means_reg[27][10]/E} {means_reg[29][10]/D} {means_reg[29][10]/E} {means_reg[3][9]/D} {means_reg[3][9]/E} {means_reg[7][9]/D} {means_reg[7][9]/E} {means_reg[11][9]/D} {means_reg[11][9]/E} {means_reg[13][9]/D} {means_reg[13][9]/E} {means_reg[19][9]/D} {means_reg[19][9]/E} {means_reg[23][9]/D} {means_reg[23][9]/E} {means_reg[27][9]/D} {means_reg[27][9]/E} {means_reg[29][9]/D} {means_reg[29][9]/E} {means_reg[3][8]/D} {means_reg[3][8]/E} {means_reg[7][8]/D} {means_reg[7][8]/E} {means_reg[11][8]/D} {means_reg[11][8]/E} {means_reg[13][8]/D} {means_reg[13][8]/E} {means_reg[19][8]/D} {means_reg[19][8]/E} {means_reg[23][8]/D} {means_reg[23][8]/E} {means_reg[27][8]/D} {means_reg[27][8]/E} {means_reg[29][8]/D} {means_reg[29][8]/E} {means_reg[3][7]/D} {means_reg[3][7]/E} {means_reg[7][7]/D} {means_reg[7][7]/E} {means_reg[11][7]/D} {means_reg[11][7]/E} {means_reg[13][7]/D} {means_reg[13][7]/E} {means_reg[19][7]/D} {means_reg[19][7]/E} {means_reg[23][7]/D} {means_reg[23][7]/E} {means_reg[27][7]/D} {means_reg[27][7]/E} {means_reg[29][7]/D} {means_reg[29][7]/E} {means_reg[3][6]/D} {means_reg[3][6]/E} {means_reg[7][6]/D} {means_reg[7][6]/E} {means_reg[11][6]/D} {means_reg[11][6]/E} {means_reg[13][6]/D} {means_reg[13][6]/E} {means_reg[19][6]/D} {means_reg[19][6]/E} {means_reg[23][6]/D} {means_reg[23][6]/E} {means_reg[27][6]/D} {means_reg[27][6]/E} {means_reg[29][6]/D} {means_reg[29][6]/E} {means_reg[11][4]/D} {means_reg[11][4]/E} {means_reg[13][4]/D} {means_reg[13][4]/E} {j_reg[3]/D} {j_reg[4]/D} {means_reg[24][7]/D} {means_reg[24][7]/E} {means_reg[0][7]/D} {means_reg[0][7]/E} {means_reg[4][7]/D} {means_reg[4][7]/E} {means_reg[8][7]/D} {means_reg[8][7]/E} {means_reg[14][7]/D} {means_reg[14][7]/E} {means_reg[16][7]/D} {means_reg[16][7]/E} {means_reg[20][7]/D} {means_reg[20][7]/E} {means_reg[30][7]/D} {means_reg[30][7]/E} {means_reg[24][6]/D} {means_reg[24][6]/E} {means_reg[0][6]/D} {means_reg[0][6]/E} {means_reg[4][6]/D} {means_reg[4][6]/E} {means_reg[8][6]/D} {means_reg[8][6]/E} {means_reg[14][6]/D} {means_reg[14][6]/E} {means_reg[16][6]/D} {means_reg[16][6]/E} {means_reg[20][6]/D} {means_reg[20][6]/E} {means_reg[30][6]/D} {means_reg[30][6]/E} {means_reg[24][5]/D} {means_reg[24][5]/E} {means_reg[0][5]/D} {means_reg[0][5]/E} {means_reg[4][5]/D} {means_reg[4][5]/E} {means_reg[8][5]/D} {means_reg[8][5]/E} {means_reg[14][5]/D} {means_reg[14][5]/E} {means_reg[16][5]/D} {means_reg[16][5]/E} {means_reg[20][5]/D} {means_reg[20][5]/E} {means_reg[30][5]/D} {means_reg[30][5]/E} {means_reg[24][4]/D} {means_reg[24][4]/E} {means_reg[0][4]/D} {means_reg[0][4]/E} {means_reg[4][4]/D} {means_reg[4][4]/E} {means_reg[8][4]/D} {means_reg[8][4]/E} {means_reg[14][4]/D} {means_reg[14][4]/E} {means_reg[16][4]/D} {means_reg[16][4]/E} {means_reg[20][4]/D} {means_reg[20][4]/E} {means_reg[30][4]/D} {means_reg[30][4]/E} {means_reg[24][3]/D} {means_reg[24][3]/E} {means_reg[0][3]/D} {means_reg[0][3]/E} {means_reg[4][3]/D} {means_reg[4][3]/E} {means_reg[8][3]/D} {means_reg[8][3]/E} {means_reg[14][3]/D} {means_reg[14][3]/E} {means_reg[16][3]/D} {means_reg[16][3]/E} {means_reg[20][3]/D} {means_reg[20][3]/E} \
{means_reg[30][3]/D} {means_reg[30][3]/E} {means_reg[24][2]/D} {means_reg[24][2]/E} {means_reg[0][2]/D} {means_reg[0][2]/E} {means_reg[4][2]/D} {means_reg[4][2]/E} {means_reg[8][2]/D} {means_reg[8][2]/E} {means_reg[14][2]/D} {means_reg[14][2]/E} {means_reg[16][2]/D} {means_reg[16][2]/E} {means_reg[20][2]/D} {means_reg[20][2]/E} {means_reg[30][2]/D} {means_reg[30][2]/E} {means_reg[24][1]/D} {means_reg[24][1]/E} {means_reg[0][1]/D} {means_reg[0][1]/E} {means_reg[4][1]/D} {means_reg[4][1]/E} {means_reg[8][1]/D} {means_reg[8][1]/E} {means_reg[14][1]/D} {means_reg[14][1]/E} {means_reg[16][1]/D} {means_reg[16][1]/E} {means_reg[20][1]/D} {means_reg[20][1]/E} {means_reg[30][1]/D} {means_reg[30][1]/E} {means_reg[24][0]/D} {means_reg[24][0]/E} {means_reg[0][0]/D} {means_reg[0][0]/E} {means_reg[4][0]/D} {means_reg[4][0]/E} {means_reg[8][0]/D} {means_reg[8][0]/E} {means_reg[14][0]/D} {means_reg[14][0]/E} {means_reg[16][0]/D} {means_reg[16][0]/E} {means_reg[20][0]/D} {means_reg[20][0]/E} {means_reg[30][0]/D} {means_reg[30][0]/E} {means_reg[1][7]/D} {means_reg[1][7]/E} {means_reg[5][7]/D} {means_reg[5][7]/E} {means_reg[9][7]/D} {means_reg[9][7]/E} {means_reg[15][7]/D} {means_reg[15][7]/E} {means_reg[17][7]/D} {means_reg[17][7]/E} {means_reg[21][7]/D} {means_reg[21][7]/E} {means_reg[25][7]/D} {means_reg[25][7]/E} {means_reg[1][6]/D} {means_reg[1][6]/E} {means_reg[5][6]/D} {means_reg[5][6]/E} {means_reg[9][6]/D} {means_reg[9][6]/E} {means_reg[15][6]/D} {means_reg[15][6]/E} {means_reg[17][6]/D} {means_reg[17][6]/E} {means_reg[21][6]/D} {means_reg[21][6]/E} {means_reg[25][6]/D} {means_reg[25][6]/E} {means_reg[1][5]/D} {means_reg[1][5]/E} {means_reg[5][5]/D} {means_reg[5][5]/E} {means_reg[9][5]/D} {means_reg[9][5]/E} {means_reg[15][5]/D} {means_reg[15][5]/E} {means_reg[17][5]/D} {means_reg[17][5]/E} {means_reg[21][5]/D} {means_reg[21][5]/E} {means_reg[25][5]/D} {means_reg[25][5]/E} {means_reg[1][4]/D} {means_reg[1][4]/E} {means_reg[5][4]/D} {means_reg[5][4]/E} {means_reg[9][4]/D} {means_reg[9][4]/E} {means_reg[15][4]/D} {means_reg[15][4]/E} {means_reg[17][4]/D} {means_reg[17][4]/E} {means_reg[21][4]/D} {means_reg[21][4]/E} {means_reg[25][4]/D} {means_reg[25][4]/E} {means_reg[1][3]/D} {means_reg[1][3]/E} {means_reg[5][3]/D} {means_reg[5][3]/E} {means_reg[9][3]/D} {means_reg[9][3]/E} {means_reg[15][3]/D} {means_reg[15][3]/E} {means_reg[17][3]/D} {means_reg[17][3]/E} {means_reg[21][3]/D} {means_reg[21][3]/E} {means_reg[25][3]/D} {means_reg[25][3]/E} {means_reg[1][2]/D} {means_reg[1][2]/E} {means_reg[5][2]/D} {means_reg[5][2]/E} {means_reg[9][2]/D} {means_reg[9][2]/E} {means_reg[15][2]/D} {means_reg[15][2]/E} {means_reg[17][2]/D} {means_reg[17][2]/E} {means_reg[21][2]/D} {means_reg[21][2]/E} {means_reg[25][2]/D} {means_reg[25][2]/E} {means_reg[1][1]/D} {means_reg[1][1]/E} {means_reg[5][1]/D} {means_reg[5][1]/E} {means_reg[9][1]/D} {means_reg[9][1]/E} {means_reg[15][1]/D} {means_reg[15][1]/E} {means_reg[17][1]/D} {means_reg[17][1]/E} {means_reg[21][1]/D} {means_reg[21][1]/E} {means_reg[25][1]/D} {means_reg[25][1]/E} {means_reg[1][0]/D} {means_reg[1][0]/E} {means_reg[5][0]/D} {means_reg[5][0]/E} {means_reg[9][0]/D} {means_reg[9][0]/E} {means_reg[15][0]/D} {means_reg[15][0]/E} {means_reg[17][0]/D} {means_reg[17][0]/E} {means_reg[21][0]/D} {means_reg[21][0]/E} {means_reg[25][0]/D} {means_reg[25][0]/E} {means_reg[2][5]/D} {means_reg[2][5]/E} {means_reg[6][5]/D} {means_reg[6][5]/E} {means_reg[10][5]/D} {means_reg[10][5]/E} {means_reg[12][5]/D} {means_reg[12][5]/E} {means_reg[18][5]/D} {means_reg[18][5]/E} {means_reg[22][5]/D} {means_reg[22][5]/E} {means_reg[26][5]/D} {means_reg[26][5]/E} {means_reg[28][5]/D} {means_reg[28][5]/E} {means_reg[18][4]/D} {means_reg[18][4]/E} {means_reg[22][4]/D} {means_reg[22][4]/E} {means_reg[26][4]/D} {means_reg[26][4]/E} {means_reg[28][4]/D} {means_reg[28][4]/E} {means_reg[2][3]/D} {means_reg[2][3]/E} {means_reg[6][3]/D} {means_reg[6][3]/E} {means_reg[10][3]/D} {means_reg[10][3]/E} {means_reg[12][3]/D} {means_reg[12][3]/E} {means_reg[18][3]/D} {means_reg[18][3]/E} {means_reg[22][3]/D} {means_reg[22][3]/E} {means_reg[26][3]/D} {means_reg[26][3]/E} {means_reg[28][3]/D} {means_reg[28][3]/E} {means_reg[2][2]/D} {means_reg[2][2]/E} {means_reg[6][2]/D} {means_reg[6][2]/E} {means_reg[10][2]/D} {means_reg[10][2]/E} {means_reg[12][2]/D} {means_reg[12][2]/E} {means_reg[18][2]/D} {means_reg[18][2]/E} {means_reg[22][2]/D} {means_reg[22][2]/E} {means_reg[26][2]/D} {means_reg[26][2]/E} {means_reg[28][2]/D} {means_reg[28][2]/E} {means_reg[2][1]/D} {means_reg[2][1]/E} {means_reg[6][1]/D} {means_reg[6][1]/E} {means_reg[10][1]/D} {means_reg[10][1]/E} {means_reg[12][1]/D} {means_reg[12][1]/E} {means_reg[18][1]/D} {means_reg[18][1]/E} {means_reg[22][1]/D} {means_reg[22][1]/E} {means_reg[26][1]/D} {means_reg[26][1]/E} {means_reg[28][1]/D} {means_reg[28][1]/E} {means_reg[2][0]/D} {means_reg[2][0]/E} {means_reg[6][0]/D} {means_reg[6][0]/E} {means_reg[10][0]/D} {means_reg[10][0]/E} {means_reg[12][0]/D} {means_reg[12][0]/E} {means_reg[18][0]/D} {means_reg[18][0]/E} {means_reg[22][0]/D} {means_reg[22][0]/E} {means_reg[26][0]/D} {means_reg[26][0]/E} {means_reg[28][0]/D} {means_reg[28][0]/E} {means_reg[3][5]/D} {means_reg[3][5]/E} {means_reg[7][5]/D} {means_reg[7][5]/E} {means_reg[11][5]/D} {means_reg[11][5]/E} {means_reg[13][5]/D} {means_reg[13][5]/E} {means_reg[19][5]/D} {means_reg[19][5]/E} {means_reg[23][5]/D} {means_reg[23][5]/E} {means_reg[27][5]/D} {means_reg[27][5]/E} {means_reg[29][5]/D} {means_reg[29][5]/E} {means_reg[3][4]/D} {means_reg[3][4]/E} {means_reg[7][4]/D} {means_reg[7][4]/E} {means_reg[19][4]/D} {means_reg[19][4]/E} {means_reg[23][4]/D} {means_reg[23][4]/E} {means_reg[27][4]/D} {means_reg[27][4]/E} {means_reg[29][4]/D} {means_reg[29][4]/E} {means_reg[3][3]/D} {means_reg[3][3]/E} {means_reg[7][3]/D} {means_reg[7][3]/E} {means_reg[11][3]/D} {means_reg[11][3]/E} {means_reg[13][3]/D} {means_reg[13][3]/E} {means_reg[19][3]/D} {means_reg[19][3]/E} {means_reg[23][3]/D} {means_reg[23][3]/E} {means_reg[27][3]/D} {means_reg[27][3]/E} {means_reg[29][3]/D} {means_reg[29][3]/E} {means_reg[3][2]/D} {means_reg[3][2]/E} {means_reg[7][2]/D} {means_reg[7][2]/E} {means_reg[11][2]/D} {means_reg[11][2]/E} {means_reg[13][2]/D} {means_reg[13][2]/E} {means_reg[19][2]/D} {means_reg[19][2]/E} {means_reg[23][2]/D} {means_reg[23][2]/E} {means_reg[27][2]/D} {means_reg[27][2]/E} {means_reg[29][2]/D} {means_reg[29][2]/E} {means_reg[3][1]/D} {means_reg[3][1]/E} {means_reg[7][1]/D} {means_reg[7][1]/E} {means_reg[11][1]/D} {means_reg[11][1]/E} {means_reg[13][1]/D} {means_reg[13][1]/E} {means_reg[19][1]/D} {means_reg[19][1]/E} {means_reg[23][1]/D} {means_reg[23][1]/E} {means_reg[27][1]/D} {means_reg[27][1]/E} {means_reg[29][1]/D} {means_reg[29][1]/E} {means_reg[3][0]/D} {means_reg[3][0]/E} {means_reg[7][0]/D} {means_reg[7][0]/E} {means_reg[11][0]/D} {means_reg[11][0]/E} {means_reg[13][0]/D} {means_reg[13][0]/E} {means_reg[19][0]/D} {means_reg[19][0]/E} {means_reg[23][0]/D} {means_reg[23][0]/E} {means_reg[27][0]/D} {means_reg[27][0]/E} {means_reg[29][0]/D} {means_reg[29][0]/E} {sum_reg[2][0]/D} {sum_reg[2][0]/RN} {sum_reg[0][0]/D} {sum_reg[0][0]/RN} {sum_reg[1][0]/D} {sum_reg[1][0]/RN} {sum_reg[1][1]/D} {sum_reg[1][1]/RN} {sum_reg[2][1]/D} {sum_reg[2][1]/RN} {sum_reg[0][1]/D} {sum_reg[0][1]/RN} {sum_reg[2][2]/D} {sum_reg[2][2]/RN} {sum_reg[0][2]/D} {sum_reg[0][2]/RN} {sum_reg[1][2]/D} {sum_reg[1][2]/RN} {sum_reg[2][3]/D} {sum_reg[2][3]/RN} {sum_reg[0][3]/D} {sum_reg[0][3]/RN} {sum_reg[1][3]/D} {sum_reg[1][3]/RN} {sum_reg[2][4]/D} {sum_reg[2][4]/RN} {sum_reg[0][4]/D} {sum_reg[0][4]/RN} {sum_reg[1][4]/D} {sum_reg[1][4]/RN} {sum_reg[1][5]/D} {sum_reg[1][5]/RN} {sum_reg[2][5]/D} {sum_reg[2][5]/RN} {sum_reg[0][5]/D} {sum_reg[0][5]/RN} {sum_reg[2][6]/D} {sum_reg[2][6]/RN} {sum_reg[0][6]/D} {sum_reg[0][6]/RN} {sum_reg[1][6]/D} {sum_reg[1][6]/RN} {sum_reg[2][7]/D} {sum_reg[2][7]/RN} {sum_reg[0][7]/D} {sum_reg[0][7]/RN} {sum_reg[1][7]/D} {sum_reg[1][7]/RN} {sum_reg[2][8]/D} {sum_reg[2][8]/RN} {sum_reg[0][8]/D} {sum_reg[0][8]/RN} {sum_reg[1][8]/D} {sum_reg[1][8]/RN} {sum_reg[2][9]/D} {sum_reg[2][9]/RN} {sum_reg[0][9]/D} {sum_reg[0][9]/RN} {sum_reg[1][9]/D} {sum_reg[1][9]/RN} \
{sum_reg[2][10]/D} {sum_reg[2][10]/RN} {sum_reg[0][10]/D} {sum_reg[0][10]/RN} {sum_reg[1][10]/D} {sum_reg[1][10]/RN} {sum_reg[2][11]/D} {sum_reg[2][11]/RN} {sum_reg[0][11]/D} {sum_reg[0][11]/RN} {sum_reg[1][11]/D} {sum_reg[1][11]/RN} {sum_reg[2][12]/D} {sum_reg[2][12]/RN} {sum_reg[0][12]/D} {sum_reg[0][12]/RN} {sum_reg[1][12]/D} {sum_reg[1][12]/RN} {sum_reg[1][13]/D} {sum_reg[1][13]/RN} {sum_reg[2][13]/D} {sum_reg[2][13]/RN} {sum_reg[0][13]/D} {sum_reg[0][13]/RN} {sum_reg[2][14]/D} {sum_reg[2][14]/RN} {sum_reg[0][14]/D} {sum_reg[0][14]/RN} {sum_reg[1][14]/D} {sum_reg[1][14]/RN} {sum_reg[2][15]/D} {sum_reg[2][15]/RN} {sum_reg[0][15]/D} {sum_reg[0][15]/RN} {sum_reg[1][15]/D} {sum_reg[1][15]/RN} {sum_reg[2][16]/D} {sum_reg[2][16]/RN} {sum_reg[0][16]/D} {sum_reg[0][16]/RN} {sum_reg[1][16]/D} {sum_reg[1][16]/RN} {sum_reg[2][17]/D} {sum_reg[2][17]/RN} {sum_reg[0][17]/D} {sum_reg[0][17]/RN} {sum_reg[1][17]/D} {sum_reg[1][17]/RN} {sum_reg[2][18]/D} {sum_reg[2][18]/RN} {sum_reg[0][18]/D} {sum_reg[0][18]/RN} {sum_reg[1][18]/D} {sum_reg[1][18]/RN} {sum_reg[2][19]/D} {sum_reg[2][19]/RN} {sum_reg[0][19]/D} {sum_reg[0][19]/RN} {sum_reg[1][19]/D} {sum_reg[1][19]/RN} {sum_reg[1][20]/D} {sum_reg[1][20]/RN} {sum_reg[2][21]/D} {sum_reg[2][21]/RN} {sum_reg[0][21]/D} {sum_reg[0][21]/RN} {sum_reg[1][21]/D} {sum_reg[1][21]/RN} {sum_reg[2][20]/D} {sum_reg[2][20]/RN} {sum_reg[0][20]/D} {sum_reg[0][20]/RN} out_valid_reg/D out_valid_reg/RN busy_reg/D busy_reg/RN {image_out_index_reg[4]/D} {image_out_index_reg[4]/E} {image_out_index_reg[3]/D} {image_out_index_reg[3]/E} {image_out_index_reg[2]/D} {image_out_index_reg[2]/E} {image_out_index_reg[1]/D} {image_out_index_reg[1]/E} {image_out_index_reg[0]/D} {image_out_index_reg[0]/E} {color_index_reg[1]/D} {color_index_reg[1]/E} {color_index_reg[0]/D} {color_index_reg[0]/E} {color_reg[0][0]/D} {color_reg[0][0]/E} {color_reg[0][1]/D} {color_reg[0][1]/E} {index_reg[31][4]/D} {index_reg[31][4]/E} {index_reg[31][3]/D} {index_reg[31][3]/E} {index_reg[31][2]/D} {index_reg[31][2]/E} {index_reg[31][1]/D} {index_reg[31][1]/E} {index_reg[31][0]/D} {index_reg[31][0]/E} {color_reg[31][0]/D} {color_reg[31][0]/E} {color_reg[31][1]/D} {color_reg[31][1]/E} {means_reg[31][10]/D} {means_reg[31][10]/E} {means_reg[31][9]/D} {means_reg[31][9]/E} {means_reg[31][8]/D} {means_reg[31][8]/E} {means_reg[31][7]/D} {means_reg[31][7]/E} {means_reg[31][6]/D} {means_reg[31][6]/E} {means_reg[31][5]/D} {means_reg[31][5]/E} {means_reg[31][4]/D} {means_reg[31][4]/E} {means_reg[31][3]/D} {means_reg[31][3]/E} {means_reg[31][2]/D} {means_reg[31][2]/E} {means_reg[31][1]/D} {means_reg[31][1]/E} {means_reg[31][0]/D} {means_reg[31][0]/E} {cur_state_reg[2]/D} {cur_state_reg[2]/RN} {cnt_reg[0][14]/D} {cnt_reg[0][14]/RN} {cnt_reg[0][13]/D} {cnt_reg[0][13]/RN} {cnt_reg[0][12]/D} {cnt_reg[0][12]/RN} {cnt_reg[0][11]/D} {cnt_reg[0][11]/RN} {cnt_reg[0][10]/D} {cnt_reg[0][10]/RN} {cnt_reg[0][9]/D} {cnt_reg[0][9]/RN} {cnt_reg[0][8]/D} {cnt_reg[0][8]/RN} {cnt_reg[0][7]/D} {cnt_reg[0][7]/RN} {cnt_reg[0][6]/D} {cnt_reg[0][6]/RN} {cnt_reg[0][5]/D} {cnt_reg[0][5]/RN} {cnt_reg[0][4]/D} {cnt_reg[0][4]/RN} {cnt_reg[0][3]/D} {cnt_reg[0][3]/RN} {cnt_reg[0][2]/D} {cnt_reg[0][2]/RN} {cnt_reg[0][1]/D} {cnt_reg[0][1]/RN} {cnt_reg[0][0]/D} {cnt_reg[0][0]/RN} {cnt_reg[1][14]/D} {cnt_reg[1][14]/RN} {cnt_reg[1][13]/D} {cnt_reg[1][13]/RN} {cnt_reg[1][12]/D} {cnt_reg[1][12]/RN} {cnt_reg[1][11]/D} {cnt_reg[1][11]/RN} {cnt_reg[1][10]/D} {cnt_reg[1][10]/RN} {cnt_reg[1][9]/D} {cnt_reg[1][9]/RN} {cnt_reg[1][8]/D} {cnt_reg[1][8]/RN} {cnt_reg[1][7]/D} {cnt_reg[1][7]/RN} {cnt_reg[1][6]/D} {cnt_reg[1][6]/RN} {cnt_reg[1][5]/D} {cnt_reg[1][5]/RN} {cnt_reg[1][4]/D} {cnt_reg[1][4]/RN} {cnt_reg[1][3]/D} {cnt_reg[1][3]/RN} {cnt_reg[1][2]/D} {cnt_reg[1][2]/RN} {cnt_reg[1][1]/D} {cnt_reg[1][1]/RN} {cnt_reg[1][0]/D} {cnt_reg[1][0]/RN} {cnt_reg[2][14]/D} {cnt_reg[2][14]/RN} {cnt_reg[2][13]/D} {cnt_reg[2][13]/RN} {cnt_reg[2][12]/D} {cnt_reg[2][12]/RN} {cnt_reg[2][11]/D} {cnt_reg[2][11]/RN} {cnt_reg[2][10]/D} {cnt_reg[2][10]/RN} {cnt_reg[2][9]/D} {cnt_reg[2][9]/RN} {cnt_reg[2][8]/D} {cnt_reg[2][8]/RN} {cnt_reg[2][7]/D} {cnt_reg[2][7]/RN} {cnt_reg[2][6]/D} {cnt_reg[2][6]/RN} {cnt_reg[2][5]/D} {cnt_reg[2][5]/RN} {cnt_reg[2][4]/D} {cnt_reg[2][4]/RN} {cnt_reg[2][3]/D} {cnt_reg[2][3]/RN} {cnt_reg[2][2]/D} {cnt_reg[2][2]/RN} {cnt_reg[2][1]/D} {cnt_reg[2][1]/RN} {cnt_reg[2][0]/D} {cnt_reg[2][0]/RN} {i_reg[3]/D} {i_reg[3]/RN} {i_reg[2]/D} {i_reg[2]/RN} {i_reg[4]/D} {i_reg[4]/RN} {i_reg[0]/D} {i_reg[0]/RN} {i_reg[1]/D} {i_reg[1]/RN}}] 
group_path -name in2reg -from [get_ports {clk reset image_in_index[4] image_in_index[3] image_in_index[2] image_in_index[1] image_in_index[0] pixel_in[23] pixel_in[22] pixel_in[21] pixel_in[20] pixel_in[19] pixel_in[18] pixel_in[17] pixel_in[16] pixel_in[15] pixel_in[14] pixel_in[13] pixel_in[12] pixel_in[11] pixel_in[10] pixel_in[9] pixel_in[8] pixel_in[7] pixel_in[6] pixel_in[5] pixel_in[4] pixel_in[3] pixel_in[2] pixel_in[1] pixel_in[0]}]  -to [get_pins {{index_reg[3][4]/D} {index_reg[3][4]/E} {index_reg[5][4]/D} {index_reg[5][4]/E} {index_reg[7][4]/D} {index_reg[7][4]/E} {index_reg[9][4]/D} {index_reg[9][4]/E} {index_reg[11][4]/D} {index_reg[11][4]/E} {index_reg[13][4]/D} {index_reg[13][4]/E} {index_reg[15][4]/D} {index_reg[15][4]/E} {index_reg[17][4]/D} {index_reg[17][4]/E} {index_reg[19][4]/D} {index_reg[19][4]/E} {index_reg[21][4]/D} {index_reg[21][4]/E} {index_reg[23][4]/D} {index_reg[23][4]/E} {index_reg[25][4]/D} {index_reg[25][4]/E} {index_reg[27][4]/D} {index_reg[27][4]/E} {index_reg[29][4]/D} {index_reg[29][4]/E} {index_reg[3][3]/D} {index_reg[3][3]/E} {index_reg[5][3]/D} {index_reg[5][3]/E} {index_reg[7][3]/D} {index_reg[7][3]/E} {index_reg[9][3]/D} {index_reg[9][3]/E} {index_reg[11][3]/D} {index_reg[11][3]/E} {index_reg[13][3]/D} {index_reg[13][3]/E} {index_reg[15][3]/D} {index_reg[15][3]/E} {index_reg[17][3]/D} {index_reg[17][3]/E} {index_reg[19][3]/D} {index_reg[19][3]/E} {index_reg[21][3]/D} {index_reg[21][3]/E} {index_reg[23][3]/D} {index_reg[23][3]/E} {index_reg[25][3]/D} {index_reg[25][3]/E} {index_reg[27][3]/D} {index_reg[27][3]/E} {index_reg[29][3]/D} {index_reg[29][3]/E} {index_reg[3][2]/D} {index_reg[3][2]/E} {index_reg[5][2]/D} {index_reg[5][2]/E} {index_reg[7][2]/D} {index_reg[7][2]/E} {index_reg[9][2]/D} {index_reg[9][2]/E} {index_reg[11][2]/D} {index_reg[11][2]/E} {index_reg[13][2]/D} {index_reg[13][2]/E} {index_reg[15][2]/D} {index_reg[15][2]/E} {index_reg[17][2]/D} {index_reg[17][2]/E} {index_reg[19][2]/D} {index_reg[19][2]/E} {index_reg[21][2]/D} {index_reg[21][2]/E} {index_reg[23][2]/D} {index_reg[23][2]/E} {index_reg[25][2]/D} {index_reg[25][2]/E} {index_reg[27][2]/D} {index_reg[27][2]/E} {index_reg[29][2]/D} {index_reg[29][2]/E} {index_reg[3][1]/D} {index_reg[3][1]/E} {index_reg[5][1]/D} {index_reg[5][1]/E} {index_reg[7][1]/D} {index_reg[7][1]/E} {index_reg[9][1]/D} {index_reg[9][1]/E} {index_reg[11][1]/D} {index_reg[11][1]/E} {index_reg[13][1]/D} {index_reg[13][1]/E} {index_reg[15][1]/D} {index_reg[15][1]/E} {index_reg[17][1]/D} {index_reg[17][1]/E} {index_reg[19][1]/D} {index_reg[19][1]/E} {index_reg[21][1]/D} {index_reg[21][1]/E} {index_reg[23][1]/D} {index_reg[23][1]/E} {index_reg[25][1]/D} {index_reg[25][1]/E} {index_reg[27][1]/D} {index_reg[27][1]/E} {index_reg[29][1]/D} {index_reg[29][1]/E} {index_reg[3][0]/D} {index_reg[3][0]/E} {index_reg[5][0]/D} {index_reg[5][0]/E} {index_reg[7][0]/D} {index_reg[7][0]/E} {index_reg[9][0]/D} {index_reg[9][0]/E} {index_reg[11][0]/D} {index_reg[11][0]/E} {index_reg[13][0]/D} {index_reg[13][0]/E} {index_reg[15][0]/D} {index_reg[15][0]/E} {index_reg[17][0]/D} {index_reg[17][0]/E} {index_reg[19][0]/D} {index_reg[19][0]/E} {index_reg[21][0]/D} {index_reg[21][0]/E} {index_reg[23][0]/D} {index_reg[23][0]/E} {index_reg[25][0]/D} {index_reg[25][0]/E} {index_reg[27][0]/D} {index_reg[27][0]/E} {index_reg[29][0]/D} {index_reg[29][0]/E} {index_reg[24][4]/D} {index_reg[24][4]/E} {index_reg[4][4]/D} {index_reg[4][4]/E} {index_reg[6][4]/D} {index_reg[6][4]/E} {index_reg[8][4]/D} {index_reg[8][4]/E} {index_reg[10][4]/D} {index_reg[10][4]/E} {index_reg[12][4]/D} {index_reg[12][4]/E} {index_reg[14][4]/D} {index_reg[14][4]/E} {index_reg[16][4]/D} {index_reg[16][4]/E} {index_reg[18][4]/D} {index_reg[18][4]/E} {index_reg[20][4]/D} {index_reg[20][4]/E} {index_reg[22][4]/D} {index_reg[22][4]/E} {index_reg[26][4]/D} {index_reg[26][4]/E} {index_reg[28][4]/D} {index_reg[28][4]/E} {index_reg[30][4]/D} {index_reg[30][4]/E} {index_reg[24][3]/D} {index_reg[24][3]/E} {index_reg[4][3]/D} {index_reg[4][3]/E} {index_reg[6][3]/D} {index_reg[6][3]/E} {index_reg[8][3]/D} {index_reg[8][3]/E} {index_reg[10][3]/D} {index_reg[10][3]/E} {index_reg[12][3]/D} {index_reg[12][3]/E} {index_reg[14][3]/D} {index_reg[14][3]/E} {index_reg[16][3]/D} {index_reg[16][3]/E} {index_reg[18][3]/D} {index_reg[18][3]/E} {index_reg[20][3]/D} {index_reg[20][3]/E} {index_reg[22][3]/D} {index_reg[22][3]/E} {index_reg[26][3]/D} {index_reg[26][3]/E} {index_reg[28][3]/D} {index_reg[28][3]/E} {index_reg[30][3]/D} {index_reg[30][3]/E} {index_reg[24][2]/D} {index_reg[24][2]/E} {index_reg[4][2]/D} {index_reg[4][2]/E} {index_reg[6][2]/D} {index_reg[6][2]/E} {index_reg[8][2]/D} {index_reg[8][2]/E} {index_reg[10][2]/D} {index_reg[10][2]/E} {index_reg[12][2]/D} {index_reg[12][2]/E} {index_reg[14][2]/D} {index_reg[14][2]/E} {index_reg[16][2]/D} {index_reg[16][2]/E} {index_reg[18][2]/D} {index_reg[18][2]/E} {index_reg[20][2]/D} {index_reg[20][2]/E} {index_reg[22][2]/D} {index_reg[22][2]/E} {index_reg[26][2]/D} {index_reg[26][2]/E} {index_reg[28][2]/D} {index_reg[28][2]/E} {index_reg[30][2]/D} {index_reg[30][2]/E} {index_reg[24][1]/D} {index_reg[24][1]/E} {index_reg[4][1]/D} {index_reg[4][1]/E} {index_reg[6][1]/D} {index_reg[6][1]/E} {index_reg[8][1]/D} {index_reg[8][1]/E} {index_reg[10][1]/D} {index_reg[10][1]/E} {index_reg[12][1]/D} {index_reg[12][1]/E} {index_reg[14][1]/D} {index_reg[14][1]/E} {index_reg[16][1]/D} {index_reg[16][1]/E} {index_reg[18][1]/D} {index_reg[18][1]/E} {index_reg[20][1]/D} {index_reg[20][1]/E} {index_reg[22][1]/D} {index_reg[22][1]/E} {index_reg[26][1]/D} {index_reg[26][1]/E} {index_reg[28][1]/D} {index_reg[28][1]/E} {index_reg[30][1]/D} {index_reg[30][1]/E} {index_reg[24][0]/D} {index_reg[24][0]/E} {index_reg[4][0]/D} {index_reg[4][0]/E} {index_reg[6][0]/D} {index_reg[6][0]/E} {index_reg[8][0]/D} {index_reg[8][0]/E} {index_reg[10][0]/D} {index_reg[10][0]/E} {index_reg[12][0]/D} {index_reg[12][0]/E} {index_reg[14][0]/D} {index_reg[14][0]/E} {index_reg[16][0]/D} {index_reg[16][0]/E} {index_reg[18][0]/D} {index_reg[18][0]/E} {index_reg[20][0]/D} {index_reg[20][0]/E} {index_reg[22][0]/D} {index_reg[22][0]/E} {index_reg[26][0]/D} {index_reg[26][0]/E} {index_reg[28][0]/D} {index_reg[28][0]/E} {index_reg[30][0]/D} {index_reg[30][0]/E} {index_reg[1][4]/D} {index_reg[1][4]/E} {index_reg[1][3]/D} {index_reg[1][3]/E} {index_reg[1][2]/D} {index_reg[1][2]/E} {index_reg[1][1]/D} {index_reg[1][1]/E} {index_reg[1][0]/D} {index_reg[1][0]/E} {index_reg[2][4]/D} {index_reg[2][4]/E} {index_reg[2][3]/D} {index_reg[2][3]/E} {index_reg[2][2]/D} {index_reg[2][2]/E} {index_reg[2][1]/D} {index_reg[2][1]/E} {index_reg[2][0]/D} {index_reg[2][0]/E} {index_reg[0][4]/D} {index_reg[0][4]/E} {index_reg[0][3]/D} {index_reg[0][3]/E} {index_reg[0][2]/D} {index_reg[0][2]/E} {index_reg[0][1]/D} {index_reg[0][1]/E} {index_reg[0][0]/D} {index_reg[0][0]/E} {pixel_count_reg[13]/D} {pixel_count_reg[13]/RN} {cur_image_index_reg[1]/D} {cur_image_index_reg[1]/E} {cur_image_index_reg[0]/D} {cur_image_index_reg[0]/E} {cur_image_index_reg[4]/D} {cur_image_index_reg[4]/E} {cur_image_index_reg[2]/D} {cur_image_index_reg[2]/E} {cur_image_index_reg[3]/D} {cur_image_index_reg[3]/E} {pixel_count_reg[10]/D} {pixel_count_reg[10]/RN} {pixel_count_reg[6]/D} {pixel_count_reg[6]/RN} {pixel_count_reg[11]/D} {pixel_count_reg[11]/RN} {pixel_count_reg[7]/D} {pixel_count_reg[7]/RN} {pixel_count_reg[8]/D} {pixel_count_reg[8]/RN} {pixel_count_reg[9]/D} {pixel_count_reg[9]/RN} {pixel_count_reg[12]/D} {pixel_count_reg[12]/RN} {color_reg[1][0]/D} {color_reg[1][0]/E} {color_reg[5][0]/D} {color_reg[5][0]/E} {color_reg[9][0]/D} {color_reg[9][0]/E} {color_reg[15][0]/D} {color_reg[15][0]/E} {color_reg[2][1]/D} {color_reg[2][1]/E} {color_reg[6][1]/D} {color_reg[6][1]/E} {color_reg[10][1]/D} {color_reg[10][1]/E} {color_reg[12][1]/D} {color_reg[12][1]/E} {color_reg[18][1]/D} {color_reg[18][1]/E} {color_reg[22][1]/D} {color_reg[22][1]/E} {color_reg[26][1]/D} {color_reg[26][1]/E} {color_reg[28][1]/D} {color_reg[28][1]/E} {color_reg[2][0]/D} {color_reg[2][0]/E} {color_reg[6][0]/D} {color_reg[6][0]/E} {color_reg[10][0]/D} {color_reg[10][0]/E} {color_reg[12][0]/D} {color_reg[12][0]/E} \
{color_reg[18][0]/D} {color_reg[18][0]/E} {color_reg[22][0]/D} {color_reg[22][0]/E} {color_reg[26][0]/D} {color_reg[26][0]/E} {color_reg[28][0]/D} {color_reg[28][0]/E} {color_reg[3][1]/D} {color_reg[3][1]/E} {color_reg[7][1]/D} {color_reg[7][1]/E} {color_reg[11][1]/D} {color_reg[11][1]/E} {color_reg[13][1]/D} {color_reg[13][1]/E} {color_reg[19][1]/D} {color_reg[19][1]/E} {color_reg[23][1]/D} {color_reg[23][1]/E} {color_reg[27][1]/D} {color_reg[27][1]/E} {color_reg[29][1]/D} {color_reg[29][1]/E} {color_reg[3][0]/D} {color_reg[3][0]/E} {color_reg[7][0]/D} {color_reg[7][0]/E} {color_reg[11][0]/D} {color_reg[11][0]/E} {color_reg[13][0]/D} {color_reg[13][0]/E} {color_reg[19][0]/D} {color_reg[19][0]/E} {color_reg[23][0]/D} {color_reg[23][0]/E} {color_reg[27][0]/D} {color_reg[27][0]/E} {color_reg[29][0]/D} {color_reg[29][0]/E} {j_reg[1]/D} {j_reg[2]/D} {j_reg[0]/D} {pixel_count_reg[3]/D} {pixel_count_reg[3]/RN} {pixel_count_reg[5]/D} {pixel_count_reg[5]/RN} {pixel_count_reg[4]/D} {pixel_count_reg[4]/RN} {cur_state_reg[0]/D} {cur_state_reg[0]/RN} {cur_state_reg[1]/D} {cur_state_reg[1]/RN} {pixel_count_reg[1]/D} {pixel_count_reg[1]/RN} {pixel_count_reg[2]/D} {pixel_count_reg[2]/RN} {pixel_count_reg[0]/D} {pixel_count_reg[0]/RN} {means_reg[24][10]/D} {means_reg[24][10]/E} {means_reg[0][10]/D} {means_reg[0][10]/E} {means_reg[4][10]/D} {means_reg[4][10]/E} {means_reg[8][10]/D} {means_reg[8][10]/E} {means_reg[14][10]/D} {means_reg[14][10]/E} {means_reg[16][10]/D} {means_reg[16][10]/E} {means_reg[20][10]/D} {means_reg[20][10]/E} {means_reg[30][10]/D} {means_reg[30][10]/E} {means_reg[24][9]/D} {means_reg[24][9]/E} {means_reg[0][9]/D} {means_reg[0][9]/E} {means_reg[4][9]/D} {means_reg[4][9]/E} {means_reg[8][9]/D} {means_reg[8][9]/E} {means_reg[14][9]/D} {means_reg[14][9]/E} {means_reg[16][9]/D} {means_reg[16][9]/E} {means_reg[20][9]/D} {means_reg[20][9]/E} {means_reg[30][9]/D} {means_reg[30][9]/E} {means_reg[24][8]/D} {means_reg[24][8]/E} {means_reg[0][8]/D} {means_reg[0][8]/E} {means_reg[4][8]/D} {means_reg[4][8]/E} {means_reg[8][8]/D} {means_reg[8][8]/E} {means_reg[14][8]/D} {means_reg[14][8]/E} {means_reg[16][8]/D} {means_reg[16][8]/E} {means_reg[20][8]/D} {means_reg[20][8]/E} {means_reg[30][8]/D} {means_reg[30][8]/E} {color_reg[24][1]/D} {color_reg[24][1]/E} {color_reg[4][1]/D} {color_reg[4][1]/E} {color_reg[8][1]/D} {color_reg[8][1]/E} {color_reg[14][1]/D} {color_reg[14][1]/E} {color_reg[16][1]/D} {color_reg[16][1]/E} {color_reg[20][1]/D} {color_reg[20][1]/E} {color_reg[30][1]/D} {color_reg[30][1]/E} {color_reg[4][0]/D} {color_reg[4][0]/E} {color_reg[8][0]/D} {color_reg[8][0]/E} {color_reg[14][0]/D} {color_reg[14][0]/E} {color_reg[16][0]/D} {color_reg[16][0]/E} {color_reg[20][0]/D} {color_reg[20][0]/E} {color_reg[24][0]/D} {color_reg[24][0]/E} {color_reg[30][0]/D} {color_reg[30][0]/E} {means_reg[1][10]/D} {means_reg[1][10]/E} {means_reg[5][10]/D} {means_reg[5][10]/E} {means_reg[9][10]/D} {means_reg[9][10]/E} {means_reg[15][10]/D} {means_reg[15][10]/E} {means_reg[17][10]/D} {means_reg[17][10]/E} {means_reg[21][10]/D} {means_reg[21][10]/E} {means_reg[25][10]/D} {means_reg[25][10]/E} {means_reg[1][9]/D} {means_reg[1][9]/E} {means_reg[5][9]/D} {means_reg[5][9]/E} {means_reg[9][9]/D} {means_reg[9][9]/E} {means_reg[15][9]/D} {means_reg[15][9]/E} {means_reg[17][9]/D} {means_reg[17][9]/E} {means_reg[21][9]/D} {means_reg[21][9]/E} {means_reg[25][9]/D} {means_reg[25][9]/E} {means_reg[1][8]/D} {means_reg[1][8]/E} {means_reg[5][8]/D} {means_reg[5][8]/E} {means_reg[9][8]/D} {means_reg[9][8]/E} {means_reg[15][8]/D} {means_reg[15][8]/E} {means_reg[17][8]/D} {means_reg[17][8]/E} {means_reg[21][8]/D} {means_reg[21][8]/E} {means_reg[25][8]/D} {means_reg[25][8]/E} {color_reg[1][1]/D} {color_reg[1][1]/E} {color_reg[5][1]/D} {color_reg[5][1]/E} {color_reg[9][1]/D} {color_reg[9][1]/E} {color_reg[15][1]/D} {color_reg[15][1]/E} {color_reg[17][1]/D} {color_reg[17][1]/E} {color_reg[21][1]/D} {color_reg[21][1]/E} {color_reg[25][1]/D} {color_reg[25][1]/E} {color_reg[17][0]/D} {color_reg[17][0]/E} {color_reg[21][0]/D} {color_reg[21][0]/E} {color_reg[25][0]/D} {color_reg[25][0]/E} {means_reg[2][10]/D} {means_reg[2][10]/E} {means_reg[6][10]/D} {means_reg[6][10]/E} {means_reg[10][10]/D} {means_reg[10][10]/E} {means_reg[12][10]/D} {means_reg[12][10]/E} {means_reg[18][10]/D} {means_reg[18][10]/E} {means_reg[22][10]/D} {means_reg[22][10]/E} {means_reg[26][10]/D} {means_reg[26][10]/E} {means_reg[28][10]/D} {means_reg[28][10]/E} {means_reg[2][9]/D} {means_reg[2][9]/E} {means_reg[6][9]/D} {means_reg[6][9]/E} {means_reg[10][9]/D} {means_reg[10][9]/E} {means_reg[12][9]/D} {means_reg[12][9]/E} {means_reg[18][9]/D} {means_reg[18][9]/E} {means_reg[22][9]/D} {means_reg[22][9]/E} {means_reg[26][9]/D} {means_reg[26][9]/E} {means_reg[28][9]/D} {means_reg[28][9]/E} {means_reg[2][8]/D} {means_reg[2][8]/E} {means_reg[6][8]/D} {means_reg[6][8]/E} {means_reg[10][8]/D} {means_reg[10][8]/E} {means_reg[12][8]/D} {means_reg[12][8]/E} {means_reg[18][8]/D} {means_reg[18][8]/E} {means_reg[22][8]/D} {means_reg[22][8]/E} {means_reg[26][8]/D} {means_reg[26][8]/E} {means_reg[28][8]/D} {means_reg[28][8]/E} {means_reg[2][7]/D} {means_reg[2][7]/E} {means_reg[6][7]/D} {means_reg[6][7]/E} {means_reg[10][7]/D} {means_reg[10][7]/E} {means_reg[12][7]/D} {means_reg[12][7]/E} {means_reg[18][7]/D} {means_reg[18][7]/E} {means_reg[22][7]/D} {means_reg[22][7]/E} {means_reg[26][7]/D} {means_reg[26][7]/E} {means_reg[28][7]/D} {means_reg[28][7]/E} {means_reg[2][6]/D} {means_reg[2][6]/E} {means_reg[6][6]/D} {means_reg[6][6]/E} {means_reg[10][6]/D} {means_reg[10][6]/E} {means_reg[12][6]/D} {means_reg[12][6]/E} {means_reg[18][6]/D} {means_reg[18][6]/E} {means_reg[22][6]/D} {means_reg[22][6]/E} {means_reg[26][6]/D} {means_reg[26][6]/E} {means_reg[28][6]/D} {means_reg[28][6]/E} {means_reg[2][4]/D} {means_reg[2][4]/E} {means_reg[6][4]/D} {means_reg[6][4]/E} {means_reg[10][4]/D} {means_reg[10][4]/E} {means_reg[12][4]/D} {means_reg[12][4]/E} {means_reg[3][10]/D} {means_reg[3][10]/E} {means_reg[7][10]/D} {means_reg[7][10]/E} {means_reg[11][10]/D} {means_reg[11][10]/E} {means_reg[13][10]/D} {means_reg[13][10]/E} {means_reg[19][10]/D} {means_reg[19][10]/E} {means_reg[23][10]/D} {means_reg[23][10]/E} {means_reg[27][10]/D} {means_reg[27][10]/E} {means_reg[29][10]/D} {means_reg[29][10]/E} {means_reg[3][9]/D} {means_reg[3][9]/E} {means_reg[7][9]/D} {means_reg[7][9]/E} {means_reg[11][9]/D} {means_reg[11][9]/E} {means_reg[13][9]/D} {means_reg[13][9]/E} {means_reg[19][9]/D} {means_reg[19][9]/E} {means_reg[23][9]/D} {means_reg[23][9]/E} {means_reg[27][9]/D} {means_reg[27][9]/E} {means_reg[29][9]/D} {means_reg[29][9]/E} {means_reg[3][8]/D} {means_reg[3][8]/E} {means_reg[7][8]/D} {means_reg[7][8]/E} {means_reg[11][8]/D} {means_reg[11][8]/E} {means_reg[13][8]/D} {means_reg[13][8]/E} {means_reg[19][8]/D} {means_reg[19][8]/E} {means_reg[23][8]/D} {means_reg[23][8]/E} {means_reg[27][8]/D} {means_reg[27][8]/E} {means_reg[29][8]/D} {means_reg[29][8]/E} {means_reg[3][7]/D} {means_reg[3][7]/E} {means_reg[7][7]/D} {means_reg[7][7]/E} {means_reg[11][7]/D} {means_reg[11][7]/E} {means_reg[13][7]/D} {means_reg[13][7]/E} {means_reg[19][7]/D} {means_reg[19][7]/E} {means_reg[23][7]/D} {means_reg[23][7]/E} {means_reg[27][7]/D} {means_reg[27][7]/E} {means_reg[29][7]/D} {means_reg[29][7]/E} {means_reg[3][6]/D} {means_reg[3][6]/E} {means_reg[7][6]/D} {means_reg[7][6]/E} {means_reg[11][6]/D} {means_reg[11][6]/E} {means_reg[13][6]/D} {means_reg[13][6]/E} {means_reg[19][6]/D} {means_reg[19][6]/E} {means_reg[23][6]/D} {means_reg[23][6]/E} {means_reg[27][6]/D} {means_reg[27][6]/E} {means_reg[29][6]/D} {means_reg[29][6]/E} {means_reg[11][4]/D} {means_reg[11][4]/E} {means_reg[13][4]/D} {means_reg[13][4]/E} {j_reg[3]/D} {j_reg[4]/D} {means_reg[24][7]/D} {means_reg[24][7]/E} {means_reg[0][7]/D} {means_reg[0][7]/E} {means_reg[4][7]/D} {means_reg[4][7]/E} {means_reg[8][7]/D} {means_reg[8][7]/E} {means_reg[14][7]/D} {means_reg[14][7]/E} {means_reg[16][7]/D} {means_reg[16][7]/E} {means_reg[20][7]/D} {means_reg[20][7]/E} {means_reg[30][7]/D} {means_reg[30][7]/E} {means_reg[24][6]/D} {means_reg[24][6]/E} {means_reg[0][6]/D} {means_reg[0][6]/E} {means_reg[4][6]/D} \
{means_reg[4][6]/E} {means_reg[8][6]/D} {means_reg[8][6]/E} {means_reg[14][6]/D} {means_reg[14][6]/E} {means_reg[16][6]/D} {means_reg[16][6]/E} {means_reg[20][6]/D} {means_reg[20][6]/E} {means_reg[30][6]/D} {means_reg[30][6]/E} {means_reg[24][5]/D} {means_reg[24][5]/E} {means_reg[0][5]/D} {means_reg[0][5]/E} {means_reg[4][5]/D} {means_reg[4][5]/E} {means_reg[8][5]/D} {means_reg[8][5]/E} {means_reg[14][5]/D} {means_reg[14][5]/E} {means_reg[16][5]/D} {means_reg[16][5]/E} {means_reg[20][5]/D} {means_reg[20][5]/E} {means_reg[30][5]/D} {means_reg[30][5]/E} {means_reg[24][4]/D} {means_reg[24][4]/E} {means_reg[0][4]/D} {means_reg[0][4]/E} {means_reg[4][4]/D} {means_reg[4][4]/E} {means_reg[8][4]/D} {means_reg[8][4]/E} {means_reg[14][4]/D} {means_reg[14][4]/E} {means_reg[16][4]/D} {means_reg[16][4]/E} {means_reg[20][4]/D} {means_reg[20][4]/E} {means_reg[30][4]/D} {means_reg[30][4]/E} {means_reg[24][3]/D} {means_reg[24][3]/E} {means_reg[0][3]/D} {means_reg[0][3]/E} {means_reg[4][3]/D} {means_reg[4][3]/E} {means_reg[8][3]/D} {means_reg[8][3]/E} {means_reg[14][3]/D} {means_reg[14][3]/E} {means_reg[16][3]/D} {means_reg[16][3]/E} {means_reg[20][3]/D} {means_reg[20][3]/E} {means_reg[30][3]/D} {means_reg[30][3]/E} {means_reg[24][2]/D} {means_reg[24][2]/E} {means_reg[0][2]/D} {means_reg[0][2]/E} {means_reg[4][2]/D} {means_reg[4][2]/E} {means_reg[8][2]/D} {means_reg[8][2]/E} {means_reg[14][2]/D} {means_reg[14][2]/E} {means_reg[16][2]/D} {means_reg[16][2]/E} {means_reg[20][2]/D} {means_reg[20][2]/E} {means_reg[30][2]/D} {means_reg[30][2]/E} {means_reg[24][1]/D} {means_reg[24][1]/E} {means_reg[0][1]/D} {means_reg[0][1]/E} {means_reg[4][1]/D} {means_reg[4][1]/E} {means_reg[8][1]/D} {means_reg[8][1]/E} {means_reg[14][1]/D} {means_reg[14][1]/E} {means_reg[16][1]/D} {means_reg[16][1]/E} {means_reg[20][1]/D} {means_reg[20][1]/E} {means_reg[30][1]/D} {means_reg[30][1]/E} {means_reg[24][0]/D} {means_reg[24][0]/E} {means_reg[0][0]/D} {means_reg[0][0]/E} {means_reg[4][0]/D} {means_reg[4][0]/E} {means_reg[8][0]/D} {means_reg[8][0]/E} {means_reg[14][0]/D} {means_reg[14][0]/E} {means_reg[16][0]/D} {means_reg[16][0]/E} {means_reg[20][0]/D} {means_reg[20][0]/E} {means_reg[30][0]/D} {means_reg[30][0]/E} {means_reg[1][7]/D} {means_reg[1][7]/E} {means_reg[5][7]/D} {means_reg[5][7]/E} {means_reg[9][7]/D} {means_reg[9][7]/E} {means_reg[15][7]/D} {means_reg[15][7]/E} {means_reg[17][7]/D} {means_reg[17][7]/E} {means_reg[21][7]/D} {means_reg[21][7]/E} {means_reg[25][7]/D} {means_reg[25][7]/E} {means_reg[1][6]/D} {means_reg[1][6]/E} {means_reg[5][6]/D} {means_reg[5][6]/E} {means_reg[9][6]/D} {means_reg[9][6]/E} {means_reg[15][6]/D} {means_reg[15][6]/E} {means_reg[17][6]/D} {means_reg[17][6]/E} {means_reg[21][6]/D} {means_reg[21][6]/E} {means_reg[25][6]/D} {means_reg[25][6]/E} {means_reg[1][5]/D} {means_reg[1][5]/E} {means_reg[5][5]/D} {means_reg[5][5]/E} {means_reg[9][5]/D} {means_reg[9][5]/E} {means_reg[15][5]/D} {means_reg[15][5]/E} {means_reg[17][5]/D} {means_reg[17][5]/E} {means_reg[21][5]/D} {means_reg[21][5]/E} {means_reg[25][5]/D} {means_reg[25][5]/E} {means_reg[1][4]/D} {means_reg[1][4]/E} {means_reg[5][4]/D} {means_reg[5][4]/E} {means_reg[9][4]/D} {means_reg[9][4]/E} {means_reg[15][4]/D} {means_reg[15][4]/E} {means_reg[17][4]/D} {means_reg[17][4]/E} {means_reg[21][4]/D} {means_reg[21][4]/E} {means_reg[25][4]/D} {means_reg[25][4]/E} {means_reg[1][3]/D} {means_reg[1][3]/E} {means_reg[5][3]/D} {means_reg[5][3]/E} {means_reg[9][3]/D} {means_reg[9][3]/E} {means_reg[15][3]/D} {means_reg[15][3]/E} {means_reg[17][3]/D} {means_reg[17][3]/E} {means_reg[21][3]/D} {means_reg[21][3]/E} {means_reg[25][3]/D} {means_reg[25][3]/E} {means_reg[1][2]/D} {means_reg[1][2]/E} {means_reg[5][2]/D} {means_reg[5][2]/E} {means_reg[9][2]/D} {means_reg[9][2]/E} {means_reg[15][2]/D} {means_reg[15][2]/E} {means_reg[17][2]/D} {means_reg[17][2]/E} {means_reg[21][2]/D} {means_reg[21][2]/E} {means_reg[25][2]/D} {means_reg[25][2]/E} {means_reg[1][1]/D} {means_reg[1][1]/E} {means_reg[5][1]/D} {means_reg[5][1]/E} {means_reg[9][1]/D} {means_reg[9][1]/E} {means_reg[15][1]/D} {means_reg[15][1]/E} {means_reg[17][1]/D} {means_reg[17][1]/E} {means_reg[21][1]/D} {means_reg[21][1]/E} {means_reg[25][1]/D} {means_reg[25][1]/E} {means_reg[1][0]/D} {means_reg[1][0]/E} {means_reg[5][0]/D} {means_reg[5][0]/E} {means_reg[9][0]/D} {means_reg[9][0]/E} {means_reg[15][0]/D} {means_reg[15][0]/E} {means_reg[17][0]/D} {means_reg[17][0]/E} {means_reg[21][0]/D} {means_reg[21][0]/E} {means_reg[25][0]/D} {means_reg[25][0]/E} {means_reg[2][5]/D} {means_reg[2][5]/E} {means_reg[6][5]/D} {means_reg[6][5]/E} {means_reg[10][5]/D} {means_reg[10][5]/E} {means_reg[12][5]/D} {means_reg[12][5]/E} {means_reg[18][5]/D} {means_reg[18][5]/E} {means_reg[22][5]/D} {means_reg[22][5]/E} {means_reg[26][5]/D} {means_reg[26][5]/E} {means_reg[28][5]/D} {means_reg[28][5]/E} {means_reg[18][4]/D} {means_reg[18][4]/E} {means_reg[22][4]/D} {means_reg[22][4]/E} {means_reg[26][4]/D} {means_reg[26][4]/E} {means_reg[28][4]/D} {means_reg[28][4]/E} {means_reg[2][3]/D} {means_reg[2][3]/E} {means_reg[6][3]/D} {means_reg[6][3]/E} {means_reg[10][3]/D} {means_reg[10][3]/E} {means_reg[12][3]/D} {means_reg[12][3]/E} {means_reg[18][3]/D} {means_reg[18][3]/E} {means_reg[22][3]/D} {means_reg[22][3]/E} {means_reg[26][3]/D} {means_reg[26][3]/E} {means_reg[28][3]/D} {means_reg[28][3]/E} {means_reg[2][2]/D} {means_reg[2][2]/E} {means_reg[6][2]/D} {means_reg[6][2]/E} {means_reg[10][2]/D} {means_reg[10][2]/E} {means_reg[12][2]/D} {means_reg[12][2]/E} {means_reg[18][2]/D} {means_reg[18][2]/E} {means_reg[22][2]/D} {means_reg[22][2]/E} {means_reg[26][2]/D} {means_reg[26][2]/E} {means_reg[28][2]/D} {means_reg[28][2]/E} {means_reg[2][1]/D} {means_reg[2][1]/E} {means_reg[6][1]/D} {means_reg[6][1]/E} {means_reg[10][1]/D} {means_reg[10][1]/E} {means_reg[12][1]/D} {means_reg[12][1]/E} {means_reg[18][1]/D} {means_reg[18][1]/E} {means_reg[22][1]/D} {means_reg[22][1]/E} {means_reg[26][1]/D} {means_reg[26][1]/E} {means_reg[28][1]/D} {means_reg[28][1]/E} {means_reg[2][0]/D} {means_reg[2][0]/E} {means_reg[6][0]/D} {means_reg[6][0]/E} {means_reg[10][0]/D} {means_reg[10][0]/E} {means_reg[12][0]/D} {means_reg[12][0]/E} {means_reg[18][0]/D} {means_reg[18][0]/E} {means_reg[22][0]/D} {means_reg[22][0]/E} {means_reg[26][0]/D} {means_reg[26][0]/E} {means_reg[28][0]/D} {means_reg[28][0]/E} {means_reg[3][5]/D} {means_reg[3][5]/E} {means_reg[7][5]/D} {means_reg[7][5]/E} {means_reg[11][5]/D} {means_reg[11][5]/E} {means_reg[13][5]/D} {means_reg[13][5]/E} {means_reg[19][5]/D} {means_reg[19][5]/E} {means_reg[23][5]/D} {means_reg[23][5]/E} {means_reg[27][5]/D} {means_reg[27][5]/E} {means_reg[29][5]/D} {means_reg[29][5]/E} {means_reg[3][4]/D} {means_reg[3][4]/E} {means_reg[7][4]/D} {means_reg[7][4]/E} {means_reg[19][4]/D} {means_reg[19][4]/E} {means_reg[23][4]/D} {means_reg[23][4]/E} {means_reg[27][4]/D} {means_reg[27][4]/E} {means_reg[29][4]/D} {means_reg[29][4]/E} {means_reg[3][3]/D} {means_reg[3][3]/E} {means_reg[7][3]/D} {means_reg[7][3]/E} {means_reg[11][3]/D} {means_reg[11][3]/E} {means_reg[13][3]/D} {means_reg[13][3]/E} {means_reg[19][3]/D} {means_reg[19][3]/E} {means_reg[23][3]/D} {means_reg[23][3]/E} {means_reg[27][3]/D} {means_reg[27][3]/E} {means_reg[29][3]/D} {means_reg[29][3]/E} {means_reg[3][2]/D} {means_reg[3][2]/E} {means_reg[7][2]/D} {means_reg[7][2]/E} {means_reg[11][2]/D} {means_reg[11][2]/E} {means_reg[13][2]/D} {means_reg[13][2]/E} {means_reg[19][2]/D} {means_reg[19][2]/E} {means_reg[23][2]/D} {means_reg[23][2]/E} {means_reg[27][2]/D} {means_reg[27][2]/E} {means_reg[29][2]/D} {means_reg[29][2]/E} {means_reg[3][1]/D} {means_reg[3][1]/E} {means_reg[7][1]/D} {means_reg[7][1]/E} {means_reg[11][1]/D} {means_reg[11][1]/E} {means_reg[13][1]/D} {means_reg[13][1]/E} {means_reg[19][1]/D} {means_reg[19][1]/E} {means_reg[23][1]/D} {means_reg[23][1]/E} {means_reg[27][1]/D} {means_reg[27][1]/E} {means_reg[29][1]/D} {means_reg[29][1]/E} {means_reg[3][0]/D} {means_reg[3][0]/E} {means_reg[7][0]/D} {means_reg[7][0]/E} {means_reg[11][0]/D} {means_reg[11][0]/E} {means_reg[13][0]/D} {means_reg[13][0]/E} {means_reg[19][0]/D} {means_reg[19][0]/E} {means_reg[23][0]/D} {means_reg[23][0]/E} {means_reg[27][0]/D} \
{means_reg[27][0]/E} {means_reg[29][0]/D} {means_reg[29][0]/E} {sum_reg[2][0]/D} {sum_reg[2][0]/RN} {sum_reg[0][0]/D} {sum_reg[0][0]/RN} {sum_reg[1][0]/D} {sum_reg[1][0]/RN} {sum_reg[1][1]/D} {sum_reg[1][1]/RN} {sum_reg[2][1]/D} {sum_reg[2][1]/RN} {sum_reg[0][1]/D} {sum_reg[0][1]/RN} {sum_reg[2][2]/D} {sum_reg[2][2]/RN} {sum_reg[0][2]/D} {sum_reg[0][2]/RN} {sum_reg[1][2]/D} {sum_reg[1][2]/RN} {sum_reg[2][3]/D} {sum_reg[2][3]/RN} {sum_reg[0][3]/D} {sum_reg[0][3]/RN} {sum_reg[1][3]/D} {sum_reg[1][3]/RN} {sum_reg[2][4]/D} {sum_reg[2][4]/RN} {sum_reg[0][4]/D} {sum_reg[0][4]/RN} {sum_reg[1][4]/D} {sum_reg[1][4]/RN} {sum_reg[1][5]/D} {sum_reg[1][5]/RN} {sum_reg[2][5]/D} {sum_reg[2][5]/RN} {sum_reg[0][5]/D} {sum_reg[0][5]/RN} {sum_reg[2][6]/D} {sum_reg[2][6]/RN} {sum_reg[0][6]/D} {sum_reg[0][6]/RN} {sum_reg[1][6]/D} {sum_reg[1][6]/RN} {sum_reg[2][7]/D} {sum_reg[2][7]/RN} {sum_reg[0][7]/D} {sum_reg[0][7]/RN} {sum_reg[1][7]/D} {sum_reg[1][7]/RN} {sum_reg[2][8]/D} {sum_reg[2][8]/RN} {sum_reg[0][8]/D} {sum_reg[0][8]/RN} {sum_reg[1][8]/D} {sum_reg[1][8]/RN} {sum_reg[2][9]/D} {sum_reg[2][9]/RN} {sum_reg[0][9]/D} {sum_reg[0][9]/RN} {sum_reg[1][9]/D} {sum_reg[1][9]/RN} {sum_reg[2][10]/D} {sum_reg[2][10]/RN} {sum_reg[0][10]/D} {sum_reg[0][10]/RN} {sum_reg[1][10]/D} {sum_reg[1][10]/RN} {sum_reg[2][11]/D} {sum_reg[2][11]/RN} {sum_reg[0][11]/D} {sum_reg[0][11]/RN} {sum_reg[1][11]/D} {sum_reg[1][11]/RN} {sum_reg[2][12]/D} {sum_reg[2][12]/RN} {sum_reg[0][12]/D} {sum_reg[0][12]/RN} {sum_reg[1][12]/D} {sum_reg[1][12]/RN} {sum_reg[1][13]/D} {sum_reg[1][13]/RN} {sum_reg[2][13]/D} {sum_reg[2][13]/RN} {sum_reg[0][13]/D} {sum_reg[0][13]/RN} {sum_reg[2][14]/D} {sum_reg[2][14]/RN} {sum_reg[0][14]/D} {sum_reg[0][14]/RN} {sum_reg[1][14]/D} {sum_reg[1][14]/RN} {sum_reg[2][15]/D} {sum_reg[2][15]/RN} {sum_reg[0][15]/D} {sum_reg[0][15]/RN} {sum_reg[1][15]/D} {sum_reg[1][15]/RN} {sum_reg[2][16]/D} {sum_reg[2][16]/RN} {sum_reg[0][16]/D} {sum_reg[0][16]/RN} {sum_reg[1][16]/D} {sum_reg[1][16]/RN} {sum_reg[2][17]/D} {sum_reg[2][17]/RN} {sum_reg[0][17]/D} {sum_reg[0][17]/RN} {sum_reg[1][17]/D} {sum_reg[1][17]/RN} {sum_reg[2][18]/D} {sum_reg[2][18]/RN} {sum_reg[0][18]/D} {sum_reg[0][18]/RN} {sum_reg[1][18]/D} {sum_reg[1][18]/RN} {sum_reg[2][19]/D} {sum_reg[2][19]/RN} {sum_reg[0][19]/D} {sum_reg[0][19]/RN} {sum_reg[1][19]/D} {sum_reg[1][19]/RN} {sum_reg[1][20]/D} {sum_reg[1][20]/RN} {sum_reg[2][21]/D} {sum_reg[2][21]/RN} {sum_reg[0][21]/D} {sum_reg[0][21]/RN} {sum_reg[1][21]/D} {sum_reg[1][21]/RN} {sum_reg[2][20]/D} {sum_reg[2][20]/RN} {sum_reg[0][20]/D} {sum_reg[0][20]/RN} out_valid_reg/D out_valid_reg/RN busy_reg/D busy_reg/RN {image_out_index_reg[4]/D} {image_out_index_reg[4]/E} {image_out_index_reg[3]/D} {image_out_index_reg[3]/E} {image_out_index_reg[2]/D} {image_out_index_reg[2]/E} {image_out_index_reg[1]/D} {image_out_index_reg[1]/E} {image_out_index_reg[0]/D} {image_out_index_reg[0]/E} {color_index_reg[1]/D} {color_index_reg[1]/E} {color_index_reg[0]/D} {color_index_reg[0]/E} {color_reg[0][0]/D} {color_reg[0][0]/E} {color_reg[0][1]/D} {color_reg[0][1]/E} {index_reg[31][4]/D} {index_reg[31][4]/E} {index_reg[31][3]/D} {index_reg[31][3]/E} {index_reg[31][2]/D} {index_reg[31][2]/E} {index_reg[31][1]/D} {index_reg[31][1]/E} {index_reg[31][0]/D} {index_reg[31][0]/E} {color_reg[31][0]/D} {color_reg[31][0]/E} {color_reg[31][1]/D} {color_reg[31][1]/E} {means_reg[31][10]/D} {means_reg[31][10]/E} {means_reg[31][9]/D} {means_reg[31][9]/E} {means_reg[31][8]/D} {means_reg[31][8]/E} {means_reg[31][7]/D} {means_reg[31][7]/E} {means_reg[31][6]/D} {means_reg[31][6]/E} {means_reg[31][5]/D} {means_reg[31][5]/E} {means_reg[31][4]/D} {means_reg[31][4]/E} {means_reg[31][3]/D} {means_reg[31][3]/E} {means_reg[31][2]/D} {means_reg[31][2]/E} {means_reg[31][1]/D} {means_reg[31][1]/E} {means_reg[31][0]/D} {means_reg[31][0]/E} {cur_state_reg[2]/D} {cur_state_reg[2]/RN} {cnt_reg[0][14]/D} {cnt_reg[0][14]/RN} {cnt_reg[0][13]/D} {cnt_reg[0][13]/RN} {cnt_reg[0][12]/D} {cnt_reg[0][12]/RN} {cnt_reg[0][11]/D} {cnt_reg[0][11]/RN} {cnt_reg[0][10]/D} {cnt_reg[0][10]/RN} {cnt_reg[0][9]/D} {cnt_reg[0][9]/RN} {cnt_reg[0][8]/D} {cnt_reg[0][8]/RN} {cnt_reg[0][7]/D} {cnt_reg[0][7]/RN} {cnt_reg[0][6]/D} {cnt_reg[0][6]/RN} {cnt_reg[0][5]/D} {cnt_reg[0][5]/RN} {cnt_reg[0][4]/D} {cnt_reg[0][4]/RN} {cnt_reg[0][3]/D} {cnt_reg[0][3]/RN} {cnt_reg[0][2]/D} {cnt_reg[0][2]/RN} {cnt_reg[0][1]/D} {cnt_reg[0][1]/RN} {cnt_reg[0][0]/D} {cnt_reg[0][0]/RN} {cnt_reg[1][14]/D} {cnt_reg[1][14]/RN} {cnt_reg[1][13]/D} {cnt_reg[1][13]/RN} {cnt_reg[1][12]/D} {cnt_reg[1][12]/RN} {cnt_reg[1][11]/D} {cnt_reg[1][11]/RN} {cnt_reg[1][10]/D} {cnt_reg[1][10]/RN} {cnt_reg[1][9]/D} {cnt_reg[1][9]/RN} {cnt_reg[1][8]/D} {cnt_reg[1][8]/RN} {cnt_reg[1][7]/D} {cnt_reg[1][7]/RN} {cnt_reg[1][6]/D} {cnt_reg[1][6]/RN} {cnt_reg[1][5]/D} {cnt_reg[1][5]/RN} {cnt_reg[1][4]/D} {cnt_reg[1][4]/RN} {cnt_reg[1][3]/D} {cnt_reg[1][3]/RN} {cnt_reg[1][2]/D} {cnt_reg[1][2]/RN} {cnt_reg[1][1]/D} {cnt_reg[1][1]/RN} {cnt_reg[1][0]/D} {cnt_reg[1][0]/RN} {cnt_reg[2][14]/D} {cnt_reg[2][14]/RN} {cnt_reg[2][13]/D} {cnt_reg[2][13]/RN} {cnt_reg[2][12]/D} {cnt_reg[2][12]/RN} {cnt_reg[2][11]/D} {cnt_reg[2][11]/RN} {cnt_reg[2][10]/D} {cnt_reg[2][10]/RN} {cnt_reg[2][9]/D} {cnt_reg[2][9]/RN} {cnt_reg[2][8]/D} {cnt_reg[2][8]/RN} {cnt_reg[2][7]/D} {cnt_reg[2][7]/RN} {cnt_reg[2][6]/D} {cnt_reg[2][6]/RN} {cnt_reg[2][5]/D} {cnt_reg[2][5]/RN} {cnt_reg[2][4]/D} {cnt_reg[2][4]/RN} {cnt_reg[2][3]/D} {cnt_reg[2][3]/RN} {cnt_reg[2][2]/D} {cnt_reg[2][2]/RN} {cnt_reg[2][1]/D} {cnt_reg[2][1]/RN} {cnt_reg[2][0]/D} {cnt_reg[2][0]/RN} {i_reg[3]/D} {i_reg[3]/RN} {i_reg[2]/D} {i_reg[2]/RN} {i_reg[4]/D} {i_reg[4]/RN} {i_reg[0]/D} {i_reg[0]/RN} {i_reg[1]/D} {i_reg[1]/RN}}] 
group_path -name in2out -from [get_ports {clk reset image_in_index[4] image_in_index[3] image_in_index[2] image_in_index[1] image_in_index[0] pixel_in[23] pixel_in[22] pixel_in[21] pixel_in[20] pixel_in[19] pixel_in[18] pixel_in[17] pixel_in[16] pixel_in[15] pixel_in[14] pixel_in[13] pixel_in[12] pixel_in[11] pixel_in[10] pixel_in[9] pixel_in[8] pixel_in[7] pixel_in[6] pixel_in[5] pixel_in[4] pixel_in[3] pixel_in[2] pixel_in[1] pixel_in[0]}]  -to [get_ports {busy out_valid color_index[1] color_index[0] image_out_index[4] image_out_index[3] image_out_index[2] image_out_index[1] image_out_index[0]}] 
group_path -name reg2out -from [get_pins {{index_reg[3][4]/CK} {index_reg[5][4]/CK} {index_reg[7][4]/CK} {index_reg[9][4]/CK} {index_reg[11][4]/CK} {index_reg[13][4]/CK} {index_reg[15][4]/CK} {index_reg[17][4]/CK} {index_reg[19][4]/CK} {index_reg[21][4]/CK} {index_reg[23][4]/CK} {index_reg[25][4]/CK} {index_reg[27][4]/CK} {index_reg[29][4]/CK} {index_reg[3][3]/CK} {index_reg[5][3]/CK} {index_reg[7][3]/CK} {index_reg[9][3]/CK} {index_reg[11][3]/CK} {index_reg[13][3]/CK} {index_reg[15][3]/CK} {index_reg[17][3]/CK} {index_reg[19][3]/CK} {index_reg[21][3]/CK} {index_reg[23][3]/CK} {index_reg[25][3]/CK} {index_reg[27][3]/CK} {index_reg[29][3]/CK} {index_reg[3][2]/CK} {index_reg[5][2]/CK} {index_reg[7][2]/CK} {index_reg[9][2]/CK} {index_reg[11][2]/CK} {index_reg[13][2]/CK} {index_reg[15][2]/CK} {index_reg[17][2]/CK} {index_reg[19][2]/CK} {index_reg[21][2]/CK} {index_reg[23][2]/CK} {index_reg[25][2]/CK} {index_reg[27][2]/CK} {index_reg[29][2]/CK} {index_reg[3][1]/CK} {index_reg[5][1]/CK} {index_reg[7][1]/CK} {index_reg[9][1]/CK} {index_reg[11][1]/CK} {index_reg[13][1]/CK} {index_reg[15][1]/CK} {index_reg[17][1]/CK} {index_reg[19][1]/CK} {index_reg[21][1]/CK} {index_reg[23][1]/CK} {index_reg[25][1]/CK} {index_reg[27][1]/CK} {index_reg[29][1]/CK} {index_reg[3][0]/CK} {index_reg[5][0]/CK} {index_reg[7][0]/CK} {index_reg[9][0]/CK} {index_reg[11][0]/CK} {index_reg[13][0]/CK} {index_reg[15][0]/CK} {index_reg[17][0]/CK} {index_reg[19][0]/CK} {index_reg[21][0]/CK} {index_reg[23][0]/CK} {index_reg[25][0]/CK} {index_reg[27][0]/CK} {index_reg[29][0]/CK} {index_reg[24][4]/CK} {index_reg[4][4]/CK} {index_reg[6][4]/CK} {index_reg[8][4]/CK} {index_reg[10][4]/CK} {index_reg[12][4]/CK} {index_reg[14][4]/CK} {index_reg[16][4]/CK} {index_reg[18][4]/CK} {index_reg[20][4]/CK} {index_reg[22][4]/CK} {index_reg[26][4]/CK} {index_reg[28][4]/CK} {index_reg[30][4]/CK} {index_reg[24][3]/CK} {index_reg[4][3]/CK} {index_reg[6][3]/CK} {index_reg[8][3]/CK} {index_reg[10][3]/CK} {index_reg[12][3]/CK} {index_reg[14][3]/CK} {index_reg[16][3]/CK} {index_reg[18][3]/CK} {index_reg[20][3]/CK} {index_reg[22][3]/CK} {index_reg[26][3]/CK} {index_reg[28][3]/CK} {index_reg[30][3]/CK} {index_reg[24][2]/CK} {index_reg[4][2]/CK} {index_reg[6][2]/CK} {index_reg[8][2]/CK} {index_reg[10][2]/CK} {index_reg[12][2]/CK} {index_reg[14][2]/CK} {index_reg[16][2]/CK} {index_reg[18][2]/CK} {index_reg[20][2]/CK} {index_reg[22][2]/CK} {index_reg[26][2]/CK} {index_reg[28][2]/CK} {index_reg[30][2]/CK} {index_reg[24][1]/CK} {index_reg[4][1]/CK} {index_reg[6][1]/CK} {index_reg[8][1]/CK} {index_reg[10][1]/CK} {index_reg[12][1]/CK} {index_reg[14][1]/CK} {index_reg[16][1]/CK} {index_reg[18][1]/CK} {index_reg[20][1]/CK} {index_reg[22][1]/CK} {index_reg[26][1]/CK} {index_reg[28][1]/CK} {index_reg[30][1]/CK} {index_reg[24][0]/CK} {index_reg[4][0]/CK} {index_reg[6][0]/CK} {index_reg[8][0]/CK} {index_reg[10][0]/CK} {index_reg[12][0]/CK} {index_reg[14][0]/CK} {index_reg[16][0]/CK} {index_reg[18][0]/CK} {index_reg[20][0]/CK} {index_reg[22][0]/CK} {index_reg[26][0]/CK} {index_reg[28][0]/CK} {index_reg[30][0]/CK} {index_reg[1][4]/CK} {index_reg[1][3]/CK} {index_reg[1][2]/CK} {index_reg[1][1]/CK} {index_reg[1][0]/CK} {index_reg[2][4]/CK} {index_reg[2][3]/CK} {index_reg[2][2]/CK} {index_reg[2][1]/CK} {index_reg[2][0]/CK} {index_reg[0][4]/CK} {index_reg[0][3]/CK} {index_reg[0][2]/CK} {index_reg[0][1]/CK} {index_reg[0][0]/CK} {pixel_count_reg[13]/CK} {cur_image_index_reg[1]/CK} {cur_image_index_reg[0]/CK} {cur_image_index_reg[4]/CK} {cur_image_index_reg[2]/CK} {cur_image_index_reg[3]/CK} {pixel_count_reg[10]/CK} {pixel_count_reg[6]/CK} {pixel_count_reg[11]/CK} {pixel_count_reg[7]/CK} {pixel_count_reg[8]/CK} {pixel_count_reg[9]/CK} {pixel_count_reg[12]/CK} {color_reg[1][0]/CK} {color_reg[5][0]/CK} {color_reg[9][0]/CK} {color_reg[15][0]/CK} {color_reg[2][1]/CK} {color_reg[6][1]/CK} {color_reg[10][1]/CK} {color_reg[12][1]/CK} {color_reg[18][1]/CK} {color_reg[22][1]/CK} {color_reg[26][1]/CK} {color_reg[28][1]/CK} {color_reg[2][0]/CK} {color_reg[6][0]/CK} {color_reg[10][0]/CK} {color_reg[12][0]/CK} {color_reg[18][0]/CK} {color_reg[22][0]/CK} {color_reg[26][0]/CK} {color_reg[28][0]/CK} {color_reg[3][1]/CK} {color_reg[7][1]/CK} {color_reg[11][1]/CK} {color_reg[13][1]/CK} {color_reg[19][1]/CK} {color_reg[23][1]/CK} {color_reg[27][1]/CK} {color_reg[29][1]/CK} {color_reg[3][0]/CK} {color_reg[7][0]/CK} {color_reg[11][0]/CK} {color_reg[13][0]/CK} {color_reg[19][0]/CK} {color_reg[23][0]/CK} {color_reg[27][0]/CK} {color_reg[29][0]/CK} {j_reg[1]/CK} {j_reg[2]/CK} {j_reg[0]/CK} {pixel_count_reg[3]/CK} {pixel_count_reg[5]/CK} {pixel_count_reg[4]/CK} {cur_state_reg[0]/CK} {cur_state_reg[1]/CK} {pixel_count_reg[1]/CK} {pixel_count_reg[2]/CK} {pixel_count_reg[0]/CK} {means_reg[24][10]/CK} {means_reg[0][10]/CK} {means_reg[4][10]/CK} {means_reg[8][10]/CK} {means_reg[14][10]/CK} {means_reg[16][10]/CK} {means_reg[20][10]/CK} {means_reg[30][10]/CK} {means_reg[24][9]/CK} {means_reg[0][9]/CK} {means_reg[4][9]/CK} {means_reg[8][9]/CK} {means_reg[14][9]/CK} {means_reg[16][9]/CK} {means_reg[20][9]/CK} {means_reg[30][9]/CK} {means_reg[24][8]/CK} {means_reg[0][8]/CK} {means_reg[4][8]/CK} {means_reg[8][8]/CK} {means_reg[14][8]/CK} {means_reg[16][8]/CK} {means_reg[20][8]/CK} {means_reg[30][8]/CK} {color_reg[24][1]/CK} {color_reg[4][1]/CK} {color_reg[8][1]/CK} {color_reg[14][1]/CK} {color_reg[16][1]/CK} {color_reg[20][1]/CK} {color_reg[30][1]/CK} {color_reg[4][0]/CK} {color_reg[8][0]/CK} {color_reg[14][0]/CK} {color_reg[16][0]/CK} {color_reg[20][0]/CK} {color_reg[24][0]/CK} {color_reg[30][0]/CK} {means_reg[1][10]/CK} {means_reg[5][10]/CK} {means_reg[9][10]/CK} {means_reg[15][10]/CK} {means_reg[17][10]/CK} {means_reg[21][10]/CK} {means_reg[25][10]/CK} {means_reg[1][9]/CK} {means_reg[5][9]/CK} {means_reg[9][9]/CK} {means_reg[15][9]/CK} {means_reg[17][9]/CK} {means_reg[21][9]/CK} {means_reg[25][9]/CK} {means_reg[1][8]/CK} {means_reg[5][8]/CK} {means_reg[9][8]/CK} {means_reg[15][8]/CK} {means_reg[17][8]/CK} {means_reg[21][8]/CK} {means_reg[25][8]/CK} {color_reg[1][1]/CK} {color_reg[5][1]/CK} {color_reg[9][1]/CK} {color_reg[15][1]/CK} {color_reg[17][1]/CK} {color_reg[21][1]/CK} {color_reg[25][1]/CK} {color_reg[17][0]/CK} {color_reg[21][0]/CK} {color_reg[25][0]/CK} {means_reg[2][10]/CK} {means_reg[6][10]/CK} {means_reg[10][10]/CK} {means_reg[12][10]/CK} {means_reg[18][10]/CK} {means_reg[22][10]/CK} {means_reg[26][10]/CK} {means_reg[28][10]/CK} {means_reg[2][9]/CK} {means_reg[6][9]/CK} {means_reg[10][9]/CK} {means_reg[12][9]/CK} {means_reg[18][9]/CK} {means_reg[22][9]/CK} {means_reg[26][9]/CK} {means_reg[28][9]/CK} {means_reg[2][8]/CK} {means_reg[6][8]/CK} {means_reg[10][8]/CK} {means_reg[12][8]/CK} {means_reg[18][8]/CK} {means_reg[22][8]/CK} {means_reg[26][8]/CK} {means_reg[28][8]/CK} {means_reg[2][7]/CK} {means_reg[6][7]/CK} {means_reg[10][7]/CK} {means_reg[12][7]/CK} {means_reg[18][7]/CK} {means_reg[22][7]/CK} {means_reg[26][7]/CK} {means_reg[28][7]/CK} {means_reg[2][6]/CK} {means_reg[6][6]/CK} {means_reg[10][6]/CK} {means_reg[12][6]/CK} {means_reg[18][6]/CK} {means_reg[22][6]/CK} {means_reg[26][6]/CK} {means_reg[28][6]/CK} {means_reg[2][4]/CK} {means_reg[6][4]/CK} {means_reg[10][4]/CK} {means_reg[12][4]/CK} {means_reg[3][10]/CK} {means_reg[7][10]/CK} {means_reg[11][10]/CK} {means_reg[13][10]/CK} {means_reg[19][10]/CK} {means_reg[23][10]/CK} {means_reg[27][10]/CK} {means_reg[29][10]/CK} {means_reg[3][9]/CK} {means_reg[7][9]/CK} {means_reg[11][9]/CK} {means_reg[13][9]/CK} {means_reg[19][9]/CK} {means_reg[23][9]/CK} {means_reg[27][9]/CK} {means_reg[29][9]/CK} {means_reg[3][8]/CK} {means_reg[7][8]/CK} {means_reg[11][8]/CK} {means_reg[13][8]/CK} {means_reg[19][8]/CK} {means_reg[23][8]/CK} {means_reg[27][8]/CK} {means_reg[29][8]/CK} {means_reg[3][7]/CK} {means_reg[7][7]/CK} {means_reg[11][7]/CK} {means_reg[13][7]/CK} {means_reg[19][7]/CK} {means_reg[23][7]/CK} {means_reg[27][7]/CK} {means_reg[29][7]/CK} {means_reg[3][6]/CK} {means_reg[7][6]/CK} {means_reg[11][6]/CK} {means_reg[13][6]/CK} {means_reg[19][6]/CK} {means_reg[23][6]/CK} {means_reg[27][6]/CK} {means_reg[29][6]/CK} {means_reg[11][4]/CK} {means_reg[13][4]/CK} {j_reg[3]/CK} {j_reg[4]/CK} \
{means_reg[24][7]/CK} {means_reg[0][7]/CK} {means_reg[4][7]/CK} {means_reg[8][7]/CK} {means_reg[14][7]/CK} {means_reg[16][7]/CK} {means_reg[20][7]/CK} {means_reg[30][7]/CK} {means_reg[24][6]/CK} {means_reg[0][6]/CK} {means_reg[4][6]/CK} {means_reg[8][6]/CK} {means_reg[14][6]/CK} {means_reg[16][6]/CK} {means_reg[20][6]/CK} {means_reg[30][6]/CK} {means_reg[24][5]/CK} {means_reg[0][5]/CK} {means_reg[4][5]/CK} {means_reg[8][5]/CK} {means_reg[14][5]/CK} {means_reg[16][5]/CK} {means_reg[20][5]/CK} {means_reg[30][5]/CK} {means_reg[24][4]/CK} {means_reg[0][4]/CK} {means_reg[4][4]/CK} {means_reg[8][4]/CK} {means_reg[14][4]/CK} {means_reg[16][4]/CK} {means_reg[20][4]/CK} {means_reg[30][4]/CK} {means_reg[24][3]/CK} {means_reg[0][3]/CK} {means_reg[4][3]/CK} {means_reg[8][3]/CK} {means_reg[14][3]/CK} {means_reg[16][3]/CK} {means_reg[20][3]/CK} {means_reg[30][3]/CK} {means_reg[24][2]/CK} {means_reg[0][2]/CK} {means_reg[4][2]/CK} {means_reg[8][2]/CK} {means_reg[14][2]/CK} {means_reg[16][2]/CK} {means_reg[20][2]/CK} {means_reg[30][2]/CK} {means_reg[24][1]/CK} {means_reg[0][1]/CK} {means_reg[4][1]/CK} {means_reg[8][1]/CK} {means_reg[14][1]/CK} {means_reg[16][1]/CK} {means_reg[20][1]/CK} {means_reg[30][1]/CK} {means_reg[24][0]/CK} {means_reg[0][0]/CK} {means_reg[4][0]/CK} {means_reg[8][0]/CK} {means_reg[14][0]/CK} {means_reg[16][0]/CK} {means_reg[20][0]/CK} {means_reg[30][0]/CK} {means_reg[1][7]/CK} {means_reg[5][7]/CK} {means_reg[9][7]/CK} {means_reg[15][7]/CK} {means_reg[17][7]/CK} {means_reg[21][7]/CK} {means_reg[25][7]/CK} {means_reg[1][6]/CK} {means_reg[5][6]/CK} {means_reg[9][6]/CK} {means_reg[15][6]/CK} {means_reg[17][6]/CK} {means_reg[21][6]/CK} {means_reg[25][6]/CK} {means_reg[1][5]/CK} {means_reg[5][5]/CK} {means_reg[9][5]/CK} {means_reg[15][5]/CK} {means_reg[17][5]/CK} {means_reg[21][5]/CK} {means_reg[25][5]/CK} {means_reg[1][4]/CK} {means_reg[5][4]/CK} {means_reg[9][4]/CK} {means_reg[15][4]/CK} {means_reg[17][4]/CK} {means_reg[21][4]/CK} {means_reg[25][4]/CK} {means_reg[1][3]/CK} {means_reg[5][3]/CK} {means_reg[9][3]/CK} {means_reg[15][3]/CK} {means_reg[17][3]/CK} {means_reg[21][3]/CK} {means_reg[25][3]/CK} {means_reg[1][2]/CK} {means_reg[5][2]/CK} {means_reg[9][2]/CK} {means_reg[15][2]/CK} {means_reg[17][2]/CK} {means_reg[21][2]/CK} {means_reg[25][2]/CK} {means_reg[1][1]/CK} {means_reg[5][1]/CK} {means_reg[9][1]/CK} {means_reg[15][1]/CK} {means_reg[17][1]/CK} {means_reg[21][1]/CK} {means_reg[25][1]/CK} {means_reg[1][0]/CK} {means_reg[5][0]/CK} {means_reg[9][0]/CK} {means_reg[15][0]/CK} {means_reg[17][0]/CK} {means_reg[21][0]/CK} {means_reg[25][0]/CK} {means_reg[2][5]/CK} {means_reg[6][5]/CK} {means_reg[10][5]/CK} {means_reg[12][5]/CK} {means_reg[18][5]/CK} {means_reg[22][5]/CK} {means_reg[26][5]/CK} {means_reg[28][5]/CK} {means_reg[18][4]/CK} {means_reg[22][4]/CK} {means_reg[26][4]/CK} {means_reg[28][4]/CK} {means_reg[2][3]/CK} {means_reg[6][3]/CK} {means_reg[10][3]/CK} {means_reg[12][3]/CK} {means_reg[18][3]/CK} {means_reg[22][3]/CK} {means_reg[26][3]/CK} {means_reg[28][3]/CK} {means_reg[2][2]/CK} {means_reg[6][2]/CK} {means_reg[10][2]/CK} {means_reg[12][2]/CK} {means_reg[18][2]/CK} {means_reg[22][2]/CK} {means_reg[26][2]/CK} {means_reg[28][2]/CK} {means_reg[2][1]/CK} {means_reg[6][1]/CK} {means_reg[10][1]/CK} {means_reg[12][1]/CK} {means_reg[18][1]/CK} {means_reg[22][1]/CK} {means_reg[26][1]/CK} {means_reg[28][1]/CK} {means_reg[2][0]/CK} {means_reg[6][0]/CK} {means_reg[10][0]/CK} {means_reg[12][0]/CK} {means_reg[18][0]/CK} {means_reg[22][0]/CK} {means_reg[26][0]/CK} {means_reg[28][0]/CK} {means_reg[3][5]/CK} {means_reg[7][5]/CK} {means_reg[11][5]/CK} {means_reg[13][5]/CK} {means_reg[19][5]/CK} {means_reg[23][5]/CK} {means_reg[27][5]/CK} {means_reg[29][5]/CK} {means_reg[3][4]/CK} {means_reg[7][4]/CK} {means_reg[19][4]/CK} {means_reg[23][4]/CK} {means_reg[27][4]/CK} {means_reg[29][4]/CK} {means_reg[3][3]/CK} {means_reg[7][3]/CK} {means_reg[11][3]/CK} {means_reg[13][3]/CK} {means_reg[19][3]/CK} {means_reg[23][3]/CK} {means_reg[27][3]/CK} {means_reg[29][3]/CK} {means_reg[3][2]/CK} {means_reg[7][2]/CK} {means_reg[11][2]/CK} {means_reg[13][2]/CK} {means_reg[19][2]/CK} {means_reg[23][2]/CK} {means_reg[27][2]/CK} {means_reg[29][2]/CK} {means_reg[3][1]/CK} {means_reg[7][1]/CK} {means_reg[11][1]/CK} {means_reg[13][1]/CK} {means_reg[19][1]/CK} {means_reg[23][1]/CK} {means_reg[27][1]/CK} {means_reg[29][1]/CK} {means_reg[3][0]/CK} {means_reg[7][0]/CK} {means_reg[11][0]/CK} {means_reg[13][0]/CK} {means_reg[19][0]/CK} {means_reg[23][0]/CK} {means_reg[27][0]/CK} {means_reg[29][0]/CK} {sum_reg[2][0]/CK} {sum_reg[0][0]/CK} {sum_reg[1][0]/CK} {sum_reg[1][1]/CK} {sum_reg[2][1]/CK} {sum_reg[0][1]/CK} {sum_reg[2][2]/CK} {sum_reg[0][2]/CK} {sum_reg[1][2]/CK} {sum_reg[2][3]/CK} {sum_reg[0][3]/CK} {sum_reg[1][3]/CK} {sum_reg[2][4]/CK} {sum_reg[0][4]/CK} {sum_reg[1][4]/CK} {sum_reg[1][5]/CK} {sum_reg[2][5]/CK} {sum_reg[0][5]/CK} {sum_reg[2][6]/CK} {sum_reg[0][6]/CK} {sum_reg[1][6]/CK} {sum_reg[2][7]/CK} {sum_reg[0][7]/CK} {sum_reg[1][7]/CK} {sum_reg[2][8]/CK} {sum_reg[0][8]/CK} {sum_reg[1][8]/CK} {sum_reg[2][9]/CK} {sum_reg[0][9]/CK} {sum_reg[1][9]/CK} {sum_reg[2][10]/CK} {sum_reg[0][10]/CK} {sum_reg[1][10]/CK} {sum_reg[2][11]/CK} {sum_reg[0][11]/CK} {sum_reg[1][11]/CK} {sum_reg[2][12]/CK} {sum_reg[0][12]/CK} {sum_reg[1][12]/CK} {sum_reg[1][13]/CK} {sum_reg[2][13]/CK} {sum_reg[0][13]/CK} {sum_reg[2][14]/CK} {sum_reg[0][14]/CK} {sum_reg[1][14]/CK} {sum_reg[2][15]/CK} {sum_reg[0][15]/CK} {sum_reg[1][15]/CK} {sum_reg[2][16]/CK} {sum_reg[0][16]/CK} {sum_reg[1][16]/CK} {sum_reg[2][17]/CK} {sum_reg[0][17]/CK} {sum_reg[1][17]/CK} {sum_reg[2][18]/CK} {sum_reg[0][18]/CK} {sum_reg[1][18]/CK} {sum_reg[2][19]/CK} {sum_reg[0][19]/CK} {sum_reg[1][19]/CK} {sum_reg[1][20]/CK} {sum_reg[2][21]/CK} {sum_reg[0][21]/CK} {sum_reg[1][21]/CK} {sum_reg[2][20]/CK} {sum_reg[0][20]/CK} out_valid_reg/CK busy_reg/CK {image_out_index_reg[4]/CK} {image_out_index_reg[3]/CK} {image_out_index_reg[2]/CK} {image_out_index_reg[1]/CK} {image_out_index_reg[0]/CK} {color_index_reg[1]/CK} {color_index_reg[0]/CK} {color_reg[0][0]/CK} {color_reg[0][1]/CK} {index_reg[31][4]/CK} {index_reg[31][3]/CK} {index_reg[31][2]/CK} {index_reg[31][1]/CK} {index_reg[31][0]/CK} {color_reg[31][0]/CK} {color_reg[31][1]/CK} {means_reg[31][10]/CK} {means_reg[31][9]/CK} {means_reg[31][8]/CK} {means_reg[31][7]/CK} {means_reg[31][6]/CK} {means_reg[31][5]/CK} {means_reg[31][4]/CK} {means_reg[31][3]/CK} {means_reg[31][2]/CK} {means_reg[31][1]/CK} {means_reg[31][0]/CK} {cur_state_reg[2]/CK} {cnt_reg[0][14]/CK} {cnt_reg[0][13]/CK} {cnt_reg[0][12]/CK} {cnt_reg[0][11]/CK} {cnt_reg[0][10]/CK} {cnt_reg[0][9]/CK} {cnt_reg[0][8]/CK} {cnt_reg[0][7]/CK} {cnt_reg[0][6]/CK} {cnt_reg[0][5]/CK} {cnt_reg[0][4]/CK} {cnt_reg[0][3]/CK} {cnt_reg[0][2]/CK} {cnt_reg[0][1]/CK} {cnt_reg[0][0]/CK} {cnt_reg[1][14]/CK} {cnt_reg[1][13]/CK} {cnt_reg[1][12]/CK} {cnt_reg[1][11]/CK} {cnt_reg[1][10]/CK} {cnt_reg[1][9]/CK} {cnt_reg[1][8]/CK} {cnt_reg[1][7]/CK} {cnt_reg[1][6]/CK} {cnt_reg[1][5]/CK} {cnt_reg[1][4]/CK} {cnt_reg[1][3]/CK} {cnt_reg[1][2]/CK} {cnt_reg[1][1]/CK} {cnt_reg[1][0]/CK} {cnt_reg[2][14]/CK} {cnt_reg[2][13]/CK} {cnt_reg[2][12]/CK} {cnt_reg[2][11]/CK} {cnt_reg[2][10]/CK} {cnt_reg[2][9]/CK} {cnt_reg[2][8]/CK} {cnt_reg[2][7]/CK} {cnt_reg[2][6]/CK} {cnt_reg[2][5]/CK} {cnt_reg[2][4]/CK} {cnt_reg[2][3]/CK} {cnt_reg[2][2]/CK} {cnt_reg[2][1]/CK} {cnt_reg[2][0]/CK} {i_reg[3]/CK} {i_reg[2]/CK} {i_reg[4]/CK} {i_reg[0]/CK} {i_reg[1]/CK}}]  -to [get_ports {busy out_valid color_index[1] color_index[0] image_out_index[4] image_out_index[3] image_out_index[2] image_out_index[1] image_out_index[0]}] 
